{"question_token_to_idx": {"<NULL>": 0, "<START>": 1, "<END>": 2, "<UNK>": 3, ",": 4, "Adidas": 5, "American": 6, "Are": 7, "Around": 8, "Asian": 9, "Before": 10, "Behind": 11, "CD": 12, "CDs": 13, "Caucasian": 14, "Chinese": 15, "Christmas": 16, "Coca": 17, "Coke": 18, "Cola": 19, "Could": 20, "DVD": 21, "DVDs": 22, "Do": 23, "Does": 24, "Eiffel": 25, "Elmo": 26, "French": 27, "From": 28, "He": 29, "How": 30, "How's": 31, "In": 32, "Inside": 33, "Is": 34, "Lego": 35, "Mexican": 36, "Mickey": 37, "Nike": 38, "Nutella": 39, "Of": 40, "On": 41, "Parmesan": 42, "SUV": 43, "She": 44, "Styrofoam": 45, "TV": 46, "TVs": 47, "That": 48, "The": 49, "This": 50, "Was": 51, "What": 52, "What's": 53, "Where": 54, "Which": 55, "Who": 56, "Wii": 57, "With": 58, "Xbox": 59, "a": 60, "abandoned": 61, "about": 62, "above": 63, "abundant": 64, "across": 65, "action": 66, "adjusting": 67, "adult": 68, "against": 69, "air": 70, "aircraft": 71, "airplane": 72, "airplane's": 73, "airplanes": 74, "airport": 75, "alarm": 76, "alcohol": 77, "alert": 78, "alien": 79, "aliens": 80, "all": 81, "alligator": 82, "alligators": 83, "almond": 84, "almonds": 85, "along": 86, "alongside": 87, "aluminum": 88, "ambulance": 89, "ambulances": 90, "an": 91, "and": 92, "angry": 93, "animal": 94, "animal's": 95, "animals": 96, "antelope": 97, "antelopes": 98, "antenna": 99, "antique": 100, "any": 101, "apartment": 102, "appear": 103, "appetizer": 104, "appetizers": 105, "apple": 106, "apples": 107, "appliance": 108, "appliances": 109, "approaching": 110, "apron": 111, "aquarium": 112, "are": 113, "aren't": 114, "armchair": 115, "armchairs": 116, "armors": 117, "around": 118, "arrow": 119, "art": 120, "artichoke": 121, "artichokes": 122, "article": 123, "articles": 124, "artwork": 125, "as": 126, "asparagus": 127, "asphalt": 128, "assorted": 129, "at": 130, "athlete": 131, "athletes": 132, "athletic": 133, "atop": 134, "attached": 135, "audience": 136, "avocado": 137, "avocadoes": 138, "avocados": 139, "away": 140, "babies": 141, "baby": 142, "baby's": 143, "back": 144, "background": 145, "backpack": 146, "backpacks": 147, "bacon": 148, "bag": 149, "bagel": 150, "bagels": 151, "bags": 152, "baked": 153, "baker": 154, "bakers": 155, "bakery": 156, "baking": 157, "balancing": 158, "balcony": 159, "bald": 160, "balding": 161, "ball": 162, "balloon": 163, "balloons": 164, "balls": 165, "bamboo": 166, "banana": 167, "bananas": 168, "band": 169, "bandage": 170, "bandages": 171, "bandana": 172, "bar": 173, "bare": 174, "barefoot": 175, "barn": 176, "barns": 177, "barrier": 178, "bartender": 179, "bartenders": 180, "baseball": 181, "baseballs": 182, "basil": 183, "basket": 184, "baskets": 185, "bat": 186, "bath": 187, "bathing": 188, "bathroom": 189, "bathrooms": 190, "bathtub": 191, "bats": 192, "batter": 193, "batteries": 194, "batters": 195, "battery": 196, "be": 197, "beach": 198, "beaches": 199, "beads": 200, "beak": 201, "beans": 202, "bear": 203, "bear's": 204, "beard": 205, "bears": 206, "beautiful": 207, "bed": 208, "bedding": 209, "bedroom": 210, "beds": 211, "bedspread": 212, "bedspreads": 213, "beef": 214, "beer": 215, "bees": 216, "beet": 217, "beets": 218, "before": 219, "behind": 220, "beige": 221, "bell": 222, "bells": 223, "below": 224, "belt": 225, "bench": 226, "benches": 227, "bending": 228, "beneath": 229, "bent": 230, "berries": 231, "berry": 232, "beside": 233, "between": 234, "beverage": 235, "beverages": 236, "bicycle": 237, "bicycles": 238, "bicyclist": 239, "big": 240, "bike": 241, "biker": 242, "bikers": 243, "bikes": 244, "bikini": 245, "bin": 246, "binder": 247, "binders": 248, "bird": 249, "bird's": 250, "birds": 251, "birthday": 252, "biscuit": 253, "biscuits": 254, "bison": 255, "bites": 256, "biting": 257, "black": 258, "blackberries": 259, "blank": 260, "blanket": 261, "blankets": 262, "blazer": 263, "bleachers": 264, "blender": 265, "blenders": 266, "blind": 267, "blinds": 268, "block": 269, "blocks": 270, "blond": 271, "blonde": 272, "blossom": 273, "blouse": 274, "blue": 275, "blueberries": 276, "blueberry": 277, "blurry": 278, "boar": 279, "board": 280, "boarding": 281, "boards": 282, "boars": 283, "boat": 284, "boats": 285, "bomb": 286, "bombs": 287, "bone": 288, "book": 289, "bookcase": 290, "bookcases": 291, "books": 292, "bookshelf": 293, "bookshelves": 294, "boot": 295, "boots": 296, "both": 297, "bottle": 298, "bottles": 299, "bottom": 300, "boulders": 301, "bouquet": 302, "bouquets": 303, "bowl": 304, "bowls": 305, "box": 306, "boxes": 307, "boy": 308, "boy's": 309, "boys": 310, "bracelet": 311, "bracelets": 312, "branch": 313, "branches": 314, "brass": 315, "bread": 316, "breads": 317, "breakfast": 318, "breast": 319, "brick": 320, "bricks": 321, "bridge": 322, "bridges": 323, "brief": 324, "briefcase": 325, "briefcases": 326, "bright": 327, "broccoli": 328, "broken": 329, "bronwy": 330, "bronze": 331, "broom": 332, "brooms": 333, "broth": 334, "brown": 335, "browned": 336, "brownie": 337, "brownies": 338, "brunette": 339, "brush": 340, "brushes": 341, "brushing": 342, "bubbles": 343, "bucket": 344, "buckets": 345, "buds": 346, "bug": 347, "building": 348, "buildings": 349, "bulb": 350, "bulbs": 351, "bull": 352, "bull's": 353, "bulls": 354, "bun": 355, "bunch": 356, "bunched": 357, "bunnies": 358, "bunny": 359, "buns": 360, "buoy": 361, "buoys": 362, "burger": 363, "burgundy": 364, "burner": 365, "burnt": 366, "burrito": 367, "burritoes": 368, "bus": 369, "buses": 370, "bush": 371, "bushes": 372, "bushy": 373, "butter": 374, "butterflies": 375, "butterfly": 376, "buying": 377, "by": 378, "cab": 379, "cabbage": 380, "cabbages": 381, "cabin": 382, "cabinet": 383, "cabinets": 384, "cabins": 385, "cable": 386, "cables": 387, "cabs": 388, "cactus": 389, "cafe": 390, "cage": 391, "cages": 392, "cake": 393, "cakes": 394, "calculator": 395, "calculators": 396, "calf": 397, "called": 398, "calm": 399, "calves": 400, "camel": 401, "camels": 402, "camera": 403, "cameras": 404, "can": 405, "candies": 406, "candle": 407, "candles": 408, "candy": 409, "cane": 410, "canes": 411, "canister": 412, "canisters": 413, "canoe": 414, "canopy": 415, "cans": 416, "cap": 417, "caps": 418, "car": 419, "card": 420, "cardboard": 421, "cards": 422, "carpet": 423, "carriage": 424, "carriages": 425, "carried": 426, "carries": 427, "carrot": 428, "carrots": 429, "carry": 430, "carrying": 431, "cars": 432, "cart": 433, "carton": 434, "carts": 435, "case": 436, "cash": 437, "casserole": 438, "castle": 439, "castles": 440, "cat": 441, "cat's": 442, "catch": 443, "catcher": 444, "catchers": 445, "catches": 446, "catching": 447, "cathedral": 448, "cats": 449, "cauliflower": 450, "ceiling": 451, "celeries": 452, "celery": 453, "cell": 454, "cellphone": 455, "cellphones": 456, "cement": 457, "center": 458, "centers": 459, "ceramic": 460, "cereal": 461, "chain": 462, "chained": 463, "chains": 464, "chair": 465, "chairs": 466, "chalkboard": 467, "chalkboards": 468, "champagne": 469, "chandelier": 470, "chandeliers": 471, "character": 472, "charger": 473, "chargers": 474, "chasing": 475, "checkered": 476, "cheese": 477, "cheeseburger": 478, "cheesecake": 479, "cheetahs": 480, "chef": 481, "chefs": 482, "cherries": 483, "cherry": 484, "chess": 485, "chewing": 486, "chicken": 487, "chickens": 488, "chickpeas": 489, "child": 490, "child's": 491, "children": 492, "chili": 493, "chimney": 494, "chimneys": 495, "chips": 496, "chocolate": 497, "chop": 498, "chopped": 499, "choppy": 500, "chopstick": 501, "chopsticks": 502, "chrome": 503, "church": 504, "churches": 505, "cigar": 506, "cigarette": 507, "cigarettes": 508, "cigars": 509, "cinnamon": 510, "city": 511, "classroom": 512, "clay": 513, "clean": 514, "cleaner": 515, "cleaning": 516, "clear": 517, "cliff": 518, "climbing": 519, "clip": 520, "clips": 521, "clock": 522, "clocks": 523, "close": 524, "closed": 525, "closet": 526, "closets": 527, "cloth": 528, "clothes": 529, "clothing": 530, "cloths": 531, "cloud": 532, "cloudless": 533, "clouds": 534, "cloudy": 535, "cluttered": 536, "coach": 537, "coaches": 538, "coat": 539, "coats": 540, "cobblestone": 541, "coca-cola": 542, "cockpit": 543, "coconut": 544, "coconuts": 545, "coffee": 546, "coin": 547, "coins": 548, "coleslaw": 549, "collar": 550, "collared": 551, "collars": 552, "color": 553, "colored": 554, "colorful": 555, "colors": 556, "comb": 557, "combs": 558, "come": 559, "comes": 560, "comfortable": 561, "comforter": 562, "comforters": 563, "coming": 564, "commercial": 565, "common": 566, "company": 567, "computer": 568, "computers": 569, "concrete": 570, "condiment": 571, "condiments": 572, "conditioner": 573, "conditioners": 574, "conditions": 575, "cone": 576, "cones": 577, "connected": 578, "console": 579, "consoles": 580, "contain": 581, "container": 582, "containers": 583, "contains": 584, "control": 585, "controller": 586, "controllers": 587, "controls": 588, "cookbooks": 589, "cooked": 590, "cooker": 591, "cookers": 592, "cookie": 593, "cookies": 594, "cooking": 595, "cooler": 596, "copper": 597, "cord": 598, "cords": 599, "corn": 600, "costume": 601, "cotton": 602, "couch": 603, "couches": 604, "could": 605, "counter": 606, "counters": 607, "countertop": 608, "couple": 609, "courtyard": 610, "cover": 611, "covered": 612, "covering": 613, "covers": 614, "cow": 615, "cow's": 616, "cowboy": 617, "cowboys": 618, "cows": 619, "crab": 620, "crabs": 621, "cracker": 622, "crackers": 623, "cranberries": 624, "cranberry": 625, "crane": 626, "crate": 627, "crates": 628, "cream": 629, "cream-colored": 630, "creamy": 631, "crispy": 632, "croissant": 633, "croissants": 634, "crooked": 635, "cross": 636, "crosses": 637, "crossing": 638, "crosswalk": 639, "crouching": 640, "crowd": 641, "crown": 642, "crowns": 643, "crumbs": 644, "crust": 645, "crusty": 646, "crystal": 647, "cube": 648, "cubes": 649, "cucumber": 650, "cucumbers": 651, "cup": 652, "cupboard": 653, "cupboards": 654, "cupcake": 655, "cupcakes": 656, "cups": 657, "curious": 658, "curled": 659, "curly": 660, "curtain": 661, "curtains": 662, "curved": 663, "cushioned": 664, "customer": 665, "customers": 666, "cut": 667, "cuts": 668, "cutter": 669, "cutting": 670, "cyclist": 671, "cyclists": 672, "dad": 673, "daisy": 674, "dark": 675, "daughter": 676, "daughters": 677, "day": 678, "deck": 679, "decker": 680, "decorated": 681, "decorating": 682, "decoration": 683, "decorations": 684, "decorative": 685, "deep": 686, "deer": 687, "delicious": 688, "denim": 689, "dense": 690, "depth": 691, "desert": 692, "designed": 693, "desk": 694, "desks": 695, "desktop": 696, "dessert": 697, "desserts": 698, "device": 699, "devices": 700, "diaper": 701, "diapers": 702, "diced": 703, "different": 704, "dining": 705, "dinner": 706, "dinosaur": 707, "dinosaurs": 708, "dip": 709, "dips": 710, "direction": 711, "dirt": 712, "dirty": 713, "dish": 714, "dishes": 715, "dishwasher": 716, "dishwashers": 717, "dispenser": 718, "dispensers": 719, "display": 720, "displayed": 721, "do": 722, "dock": 723, "does": 724, "dog": 725, "dog's": 726, "dogs": 727, "doing": 728, "doll": 729, "dolls": 730, "dolphin": 731, "dolphins": 732, "dome": 733, "donkey": 734, "donkeys": 735, "donut": 736, "donuts": 737, "door": 738, "doors": 739, "doorway": 740, "dotted": 741, "double": 742, "dough": 743, "doughnut": 744, "doughnuts": 745, "down": 746, "dragging": 747, "dragon": 748, "dragonflies": 749, "dragons": 750, "drain": 751, "drainer": 752, "drainers": 753, "drape": 754, "draped": 755, "draperies": 756, "drapery": 757, "drapes": 758, "drawer": 759, "drawers": 760, "drawing": 761, "drawings": 762, "dream": 763, "dress": 764, "dressed": 765, "dresser": 766, "dressers": 767, "dressing": 768, "dried": 769, "drink": 770, "drinking": 771, "drinks": 772, "drive": 773, "driver": 774, "drivers": 775, "drives": 776, "driving": 777, "drum": 778, "drums": 779, "dry": 780, "dry-erase": 781, "dryer": 782, "dryers": 783, "duck": 784, "ducks": 785, "dugout": 786, "dull": 787, "dumplings": 788, "dumpster": 789, "dumpsters": 790, "eagle": 791, "eagles": 792, "ear": 793, "earphones": 794, "earring": 795, "earrings": 796, "eat": 797, "eaten": 798, "eating": 799, "eats": 800, "edge": 801, "edged": 802, "egg": 803, "eggplant": 804, "eggplants": 805, "eggs": 806, "either": 807, "elbow": 808, "elderly": 809, "electric": 810, "electrical": 811, "elephant": 812, "elephant's": 813, "elephants": 814, "employee": 815, "employees": 816, "empty": 817, "enclosing": 818, "end": 819, "engine": 820, "engineer": 821, "engineers": 822, "entering": 823, "entertainment": 824, "entrance": 825, "entrees": 826, "envelope": 827, "envelopes": 828, "ethnic": 829, "ethnicity": 830, "evergreen": 831, "exiting": 832, "extinguisher": 833, "extinguishers": 834, "eye": 835, "eyeglasses": 836, "eyes": 837, "face": 838, "faces": 839, "facing": 840, "factory": 841, "faded": 842, "fake": 843, "falling": 844, "family": 845, "fan": 846, "fancy": 847, "fans": 848, "farm": 849, "farmer": 850, "farmers": 851, "fashioned": 852, "fast": 853, "fat": 854, "father": 855, "fathers": 856, "faucet": 857, "faucets": 858, "feathers": 859, "feeder": 860, "feeding": 861, "female": 862, "fence": 863, "fenced": 864, "fences": 865, "feta": 866, "field": 867, "figure": 868, "figurine": 869, "figurines": 870, "filled": 871, "fire": 872, "fireplace": 873, "fish": 874, "fisherman": 875, "fishermen": 876, "fixture": 877, "flag": 878, "flags": 879, "flames": 880, "flamingo": 881, "flamingoes": 882, "flat": 883, "flatbreads": 884, "flavor": 885, "flies": 886, "flip": 887, "floating": 888, "floats": 889, "floor": 890, "flop": 891, "flops": 892, "floral": 893, "flour": 894, "flower": 895, "flowered": 896, "flowers": 897, "fluffy": 898, "fly": 899, "flying": 900, "fog": 901, "foggy": 902, "foil": 903, "folded": 904, "folding": 905, "followed": 906, "following": 907, "follows": 908, "food": 909, "football": 910, "footballs": 911, "for": 912, "forest": 913, "fork": 914, "forks": 915, "formal": 916, "fountain": 917, "frame": 918, "framed": 919, "freezer": 920, "fresh": 921, "fridge": 922, "fried": 923, "fries": 924, "frisbee": 925, "frisbees": 926, "frog": 927, "frogs": 928, "from": 929, "front": 930, "frosted": 931, "frosting": 932, "fruit": 933, "fruits": 934, "fry": 935, "full": 936, "fur": 937, "furniture": 938, "furry": 939, "fuzzy": 940, "gadget": 941, "gadgets": 942, "game": 943, "games": 944, "garage": 945, "garbage": 946, "garden": 947, "garland": 948, "garlands": 949, "garlic": 950, "garment": 951, "garnish": 952, "gas": 953, "gate": 954, "geese": 955, "gender": 956, "gentleman": 957, "gentlemen": 958, "getting": 959, "giant": 960, "gift": 961, "gifts": 962, "giraffe": 963, "giraffe's": 964, "giraffes": 965, "girl": 966, "girl's": 967, "girls": 968, "glass": 969, "glasses": 970, "glaze": 971, "glazed": 972, "glove": 973, "gloves": 974, "glowing": 975, "goal": 976, "goat": 977, "goat's": 978, "goats": 979, "goggles": 980, "going": 981, "gold": 982, "golden": 983, "good": 984, "goose": 985, "gorilla": 986, "gorillas": 987, "gourds": 988, "gown": 989, "grabbing": 990, "graffiti": 991, "granite": 992, "granola": 993, "grape": 994, "grapefruit": 995, "grapefruits": 996, "grapes": 997, "grass": 998, "grassy": 999, "grater": 1000, "gravel": 1001, "gravy": 1002, "gray": 1003, "grazes": 1004, "grazing": 1005, "green": 1006, "grill": 1007, "grilled": 1008, "grinder": 1009, "grinders": 1010, "ground": 1011, "group": 1012, "grouped": 1013, "grow": 1014, "growing": 1015, "grows": 1016, "guacamole": 1017, "guiding": 1018, "guitar": 1019, "guitars": 1020, "gull": 1021, "gulls": 1022, "gummy": 1023, "gun": 1024, "guy": 1025, "guy's": 1026, "guys": 1027, "hair": 1028, "hairbrush": 1029, "hairbrushes": 1030, "hairy": 1031, "hallway": 1032, "halved": 1033, "ham": 1034, "hamburger": 1035, "hamburgers": 1036, "hammer": 1037, "hammers": 1038, "hand": 1039, "handbag": 1040, "hang": 1041, "hangar": 1042, "hanging": 1043, "hangs": 1044, "happy": 1045, "harbor": 1046, "hard": 1047, "hardwood": 1048, "has": 1049, "hat": 1050, "hats": 1051, "have": 1052, "having": 1053, "hay": 1054, "he": 1055, "head": 1056, "headband": 1057, "headboard": 1058, "headphones": 1059, "healthier": 1060, "healthy": 1061, "heart": 1062, "hearts": 1063, "heater": 1064, "heaters": 1065, "heavy": 1066, "hedge": 1067, "hedges": 1068, "heel": 1069, "heels": 1070, "height": 1071, "held": 1072, "helicopter": 1073, "helmet": 1074, "helmets": 1075, "helping": 1076, "her": 1077, "herb": 1078, "herbs": 1079, "herd": 1080, "herding": 1081, "high": 1082, "highway": 1083, "hill": 1084, "hills": 1085, "hillside": 1086, "him": 1087, "hippo": 1088, "hippoes": 1089, "hippos": 1090, "his": 1091, "hit": 1092, "hits": 1093, "hitting": 1094, "hold": 1095, "holder": 1096, "holding": 1097, "holds": 1098, "home": 1099, "homemade": 1100, "homes": 1101, "honey": 1102, "hook": 1103, "horizontal": 1104, "horn": 1105, "horns": 1106, "horse": 1107, "horse's": 1108, "horses": 1109, "hose": 1110, "hoses": 1111, "hospital": 1112, "hot": 1113, "hotdog": 1114, "hotel": 1115, "hotels": 1116, "house": 1117, "houses": 1118, "huge": 1119, "hugging": 1120, "hung": 1121, "hurdle": 1122, "hydrant": 1123, "hydrants": 1124, "ice": 1125, "ice-cream": 1126, "iced": 1127, "icing": 1128, "illuminated": 1129, "image": 1130, "in": 1131, "indoors": 1132, "inside": 1133, "instrument": 1134, "intersection": 1135, "into": 1136, "ipod": 1137, "ipods": 1138, "iron": 1139, "is": 1140, "island": 1141, "isn't": 1142, "it": 1143, "item": 1144, "items": 1145, "jacket": 1146, "jackets": 1147, "jar": 1148, "jars": 1149, "jeans": 1150, "jeep": 1151, "jeeps": 1152, "jersey": 1153, "jet": 1154, "jets": 1155, "jockey": 1156, "jockeys": 1157, "juice": 1158, "juicy": 1159, "jump": 1160, "jumping": 1161, "jumpsuit": 1162, "kangaroos": 1163, "kayak": 1164, "kept": 1165, "ketchup": 1166, "kettle": 1167, "kettles": 1168, "keyboard": 1169, "keyboards": 1170, "keypad": 1171, "khaki": 1172, "kicking": 1173, "kid": 1174, "kids": 1175, "kind": 1176, "kiosk": 1177, "kissing": 1178, "kitchen": 1179, "kitchens": 1180, "kite": 1181, "kites": 1182, "kitten": 1183, "kittens": 1184, "kiwi": 1185, "kiwis": 1186, "knee": 1187, "kneeling": 1188, "knife": 1189, "knit": 1190, "knives": 1191, "label": 1192, "lace": 1193, "ladder": 1194, "ladders": 1195, "ladies": 1196, "ladle": 1197, "ladles": 1198, "lady": 1199, "lady's": 1200, "lake": 1201, "lamb": 1202, "lambs": 1203, "lamp": 1204, "lamps": 1205, "laptop": 1206, "laptops": 1207, "large": 1208, "larger": 1209, "laughing": 1210, "lawn": 1211, "leading": 1212, "leaf": 1213, "leafless": 1214, "leafy": 1215, "lean": 1216, "leaning": 1217, "leans": 1218, "leather": 1219, "leaves": 1220, "leaving": 1221, "left": 1222, "leggings": 1223, "lemon": 1224, "lemonade": 1225, "lemons": 1226, "length": 1227, "leopards": 1228, "less": 1229, "letter": 1230, "letters": 1231, "lettuce": 1232, "library": 1233, "license": 1234, "licking": 1235, "lid": 1236, "lie": 1237, "lies": 1238, "life": 1239, "lift": 1240, "light": 1241, "lighthouse": 1242, "lighthouses": 1243, "lights": 1244, "like": 1245, "lily": 1246, "lime": 1247, "limes": 1248, "line": 1249, "lined": 1250, "lines": 1251, "lion": 1252, "lions": 1253, "lips": 1254, "lipstick": 1255, "lipsticks": 1256, "liquid": 1257, "liquor": 1258, "lit": 1259, "litter": 1260, "little": 1261, "living": 1262, "lizard": 1263, "lizards": 1264, "loaf": 1265, "loaves": 1266, "lobster": 1267, "lobsters": 1268, "located": 1269, "lock": 1270, "locks": 1271, "locomotive": 1272, "locomotives": 1273, "log": 1274, "logo": 1275, "logs": 1276, "long": 1277, "look": 1278, "looking": 1279, "looks": 1280, "lot": 1281, "lounge": 1282, "low": 1283, "luggage": 1284, "lunch": 1285, "lush": 1286, "lying": 1287, "lying-down": 1288, "macaroni": 1289, "machine": 1290, "machines": 1291, "made": 1292, "magazine": 1293, "magazines": 1294, "magnet": 1295, "magnets": 1296, "mailbox": 1297, "mailboxes": 1298, "make": 1299, "maker": 1300, "makers": 1301, "makes": 1302, "making": 1303, "male": 1304, "man": 1305, "man's": 1306, "mane": 1307, "mango": 1308, "mangoes": 1309, "mangos": 1310, "manhole": 1311, "mannequin": 1312, "mannequins": 1313, "map": 1314, "marble": 1315, "marina": 1316, "marker": 1317, "market": 1318, "maroon": 1319, "marshmallow": 1320, "marshmallows": 1321, "mashed": 1322, "mask": 1323, "massive": 1324, "mat": 1325, "match": 1326, "material": 1327, "mats": 1328, "mattress": 1329, "mattresses": 1330, "mature": 1331, "maybe": 1332, "mayonnaise": 1333, "meadow": 1334, "meal": 1335, "meat": 1336, "meatballs": 1337, "meats": 1338, "medicine": 1339, "meeting": 1340, "melon": 1341, "melons": 1342, "melted": 1343, "men": 1344, "menu": 1345, "merchandise": 1346, "mesh": 1347, "messy": 1348, "metal": 1349, "metallic": 1350, "meter": 1351, "meters": 1352, "mice": 1353, "microphone": 1354, "microphones": 1355, "microwave": 1356, "microwaves": 1357, "middle": 1358, "military": 1359, "milk": 1360, "milkshake": 1361, "minivan": 1362, "minivans": 1363, "mirror": 1364, "mirrors": 1365, "mitt": 1366, "mixed": 1367, "mixer": 1368, "mixers": 1369, "mixing": 1370, "mobile": 1371, "modern": 1372, "mom": 1373, "monitor": 1374, "monitors": 1375, "monkey": 1376, "monkeys": 1377, "moon": 1378, "mooses": 1379, "moss": 1380, "mother": 1381, "mothers": 1382, "motorbike": 1383, "motorbikes": 1384, "motorcycle": 1385, "motorcycles": 1386, "motorcyclist": 1387, "mound": 1388, "mountain": 1389, "mountains": 1390, "mounted": 1391, "mouse": 1392, "mousepad": 1393, "mouses": 1394, "mousess": 1395, "movies": 1396, "mozzarella": 1397, "mud": 1398, "muffin": 1399, "muffins": 1400, "mug": 1401, "mugs": 1402, "murky": 1403, "museum": 1404, "mushroom": 1405, "mushrooms": 1406, "mustache": 1407, "mustard": 1408, "name": 1409, "napkin": 1410, "napkins": 1411, "narrow": 1412, "navy": 1413, "near": 1414, "necklace": 1415, "necktie": 1416, "nest": 1417, "nests": 1418, "net": 1419, "new": 1420, "newspaper": 1421, "next": 1422, "nightstand": 1423, "nightstands": 1424, "noodles": 1425, "nose": 1426, "not": 1427, "notebook": 1428, "notebooks": 1429, "notepad": 1430, "notepads": 1431, "notes": 1432, "number": 1433, "numbers": 1434, "nut": 1435, "nuts": 1436, "oak": 1437, "oar": 1438, "oatmeal": 1439, "object": 1440, "objects": 1441, "observable": 1442, "observing": 1443, "ocean": 1444, "oceans": 1445, "octagonal": 1446, "octopus": 1447, "of": 1448, "off": 1449, "office": 1450, "officer": 1451, "officers": 1452, "oil": 1453, "old": 1454, "older": 1455, "olive": 1456, "olives": 1457, "omelette": 1458, "on": 1459, "onion": 1460, "onions": 1461, "onto": 1462, "opaque": 1463, "open": 1464, "opener": 1465, "opening": 1466, "or": 1467, "orange": 1468, "oranges": 1469, "ornament": 1470, "ornate": 1471, "ostrich": 1472, "ostriches": 1473, "other": 1474, "ottoman": 1475, "ottomen": 1476, "out": 1477, "outdoors": 1478, "outfit": 1479, "outlet": 1480, "outside": 1481, "oval": 1482, "oven": 1483, "ovens": 1484, "over": 1485, "overcast": 1486, "overhead": 1487, "owl": 1488, "owls": 1489, "package": 1490, "packet": 1491, "packets": 1492, "pad": 1493, "padded": 1494, "paddle": 1495, "paddles": 1496, "pads": 1497, "paint": 1498, "painted": 1499, "painting": 1500, "paintings": 1501, "pajamas": 1502, "pale": 1503, "palm": 1504, "palms": 1505, "pan": 1506, "pancake": 1507, "pancakes": 1508, "panda": 1509, "pandas": 1510, "panel": 1511, "pans": 1512, "pants": 1513, "papaya": 1514, "papayas": 1515, "paper": 1516, "papers": 1517, "parachute": 1518, "parachutes": 1519, "parent": 1520, "parents": 1521, "park": 1522, "parked": 1523, "parking": 1524, "parrot": 1525, "parrots": 1526, "parsley": 1527, "part": 1528, "partly": 1529, "passenger": 1530, "passengers": 1531, "past": 1532, "pasta": 1533, "pastries": 1534, "pastry": 1535, "pasture": 1536, "path": 1537, "patio": 1538, "pattern": 1539, "patterned": 1540, "paved": 1541, "pavement": 1542, "pea": 1543, "peach": 1544, "peaches": 1545, "peacock": 1546, "peacocks": 1547, "peanut": 1548, "peanuts": 1549, "pear": 1550, "pears": 1551, "peas": 1552, "pecan": 1553, "pecans": 1554, "pedestrian": 1555, "pedestrians": 1556, "peel": 1557, "peeled": 1558, "pen": 1559, "pencil": 1560, "pencils": 1561, "penguin": 1562, "penguins": 1563, "pens": 1564, "people": 1565, "pepper": 1566, "pepperoni": 1567, "peppers": 1568, "perched": 1569, "performer": 1570, "performers": 1571, "performing": 1572, "person": 1573, "person's": 1574, "pet": 1575, "pets": 1576, "petting": 1577, "phone": 1578, "phones": 1579, "photo": 1580, "photograph": 1581, "photographer": 1582, "photographers": 1583, "photographing": 1584, "piano": 1585, "pianoes": 1586, "picking": 1587, "pickles": 1588, "picnic": 1589, "picture": 1590, "pictured": 1591, "pictures": 1592, "pie": 1593, "piece": 1594, "pieces": 1595, "pier": 1596, "pies": 1597, "pig": 1598, "pigeon": 1599, "pigeons": 1600, "pigs": 1601, "piled": 1602, "pillars": 1603, "pillow": 1604, "pillowcase": 1605, "pillowcases": 1606, "pillows": 1607, "pilot": 1608, "pilots": 1609, "pin": 1610, "pine": 1611, "pineapple": 1612, "pineapples": 1613, "pines": 1614, "pink": 1615, "pipe": 1616, "pipes": 1617, "pistachio": 1618, "pistachios": 1619, "pita": 1620, "pitcher": 1621, "pizza": 1622, "pizzas": 1623, "place": 1624, "placemat": 1625, "placemats": 1626, "plaid": 1627, "plain": 1628, "plane": 1629, "planes": 1630, "plant": 1631, "plantains": 1632, "planter": 1633, "planters": 1634, "plants": 1635, "plastic": 1636, "plate": 1637, "plates": 1638, "platform": 1639, "platter": 1640, "play": 1641, "player": 1642, "player's": 1643, "players": 1644, "playing": 1645, "plays": 1646, "pliers": 1647, "plugged": 1648, "plush": 1649, "pocket": 1650, "pockets": 1651, "point": 1652, "pointing": 1653, "polar": 1654, "pole": 1655, "police": 1656, "policeman": 1657, "policemen": 1658, "polo": 1659, "pomegranate": 1660, "pomegranates": 1661, "pond": 1662, "poodle": 1663, "poodles": 1664, "pool": 1665, "popcorn": 1666, "porcelain": 1667, "porch": 1668, "pork": 1669, "portable": 1670, "posing": 1671, "post": 1672, "poster": 1673, "pot": 1674, "potato": 1675, "potatoes": 1676, "pots": 1677, "potted": 1678, "pouch": 1679, "pouring": 1680, "powder": 1681, "powdered": 1682, "power": 1683, "powerline": 1684, "powerlines": 1685, "preparing": 1686, "presented": 1687, "preserver": 1688, "pretty": 1689, "pretzel": 1690, "pretzels": 1691, "price": 1692, "printed": 1693, "printer": 1694, "printers": 1695, "processor": 1696, "processors": 1697, "produce": 1698, "professional": 1699, "projector": 1700, "projectors": 1701, "propeller": 1702, "pudding": 1703, "puddle": 1704, "puffy": 1705, "pull": 1706, "pulled": 1707, "pulling": 1708, "pulls": 1709, "pump": 1710, "pumpkin": 1711, "pumpkins": 1712, "puppies": 1713, "puppy": 1714, "puppys": 1715, "purple": 1716, "purse": 1717, "purses": 1718, "push": 1719, "pushed": 1720, "pushes": 1721, "pushing": 1722, "quilt": 1723, "rabbit": 1724, "rabbits": 1725, "race": 1726, "racket": 1727, "rackets": 1728, "radiator": 1729, "radiators": 1730, "radio": 1731, "radios": 1732, "railroad": 1733, "rain": 1734, "rainbow": 1735, "raincoat": 1736, "rainy": 1737, "raisin": 1738, "raisins": 1739, "ramekin": 1740, "raspberries": 1741, "raspberry": 1742, "ravioli": 1743, "raw": 1744, "reaching": 1745, "read": 1746, "reading": 1747, "reads": 1748, "real": 1749, "receipt": 1750, "rectangular": 1751, "red": 1752, "reflected": 1753, "reflecting": 1754, "reflective": 1755, "refrigerator": 1756, "refrigerators": 1757, "register": 1758, "registers": 1759, "regular": 1760, "remote": 1761, "remotes": 1762, "represent": 1763, "rest": 1764, "restaurant": 1765, "resting": 1766, "rests": 1767, "rhino": 1768, "rhinos": 1769, "ribs": 1770, "rice": 1771, "ride": 1772, "rides": 1773, "riding": 1774, "rifle": 1775, "right": 1776, "ring": 1777, "rings": 1778, "ripe": 1779, "river": 1780, "rivers": 1781, "road": 1782, "roadside": 1783, "roadway": 1784, "roast": 1785, "roasted": 1786, "robe": 1787, "robot": 1788, "rock": 1789, "rocks": 1790, "rocky": 1791, "roll": 1792, "rolled": 1793, "rolling": 1794, "rolls": 1795, "roof": 1796, "rooftop": 1797, "room": 1798, "rope": 1799, "ropes": 1800, "rose": 1801, "roses": 1802, "rotten": 1803, "rough": 1804, "round": 1805, "rounded": 1806, "router": 1807, "routers": 1808, "rubber": 1809, "rug": 1810, "rugs": 1811, "run": 1812, "running": 1813, "runs": 1814, "runway": 1815, "rustic": 1816, "rusty": 1817, "sack": 1818, "sacks": 1819, "sad": 1820, "safety": 1821, "sail": 1822, "sailboat": 1823, "sailboats": 1824, "salad": 1825, "salmon": 1826, "salt": 1827, "same": 1828, "sand": 1829, "sandal": 1830, "sandals": 1831, "sandwich": 1832, "sandwiches": 1833, "sandy": 1834, "satellite": 1835, "sauce": 1836, "saucer": 1837, "saucers": 1838, "sausage": 1839, "sausages": 1840, "scaffolding": 1841, "scarf": 1842, "scarves": 1843, "scattered": 1844, "scene": 1845, "school": 1846, "scissors": 1847, "scooter": 1848, "scooters": 1849, "screen": 1850, "screens": 1851, "scrub": 1852, "sculpture": 1853, "sculptures": 1854, "sea": 1855, "seafood": 1856, "seagull": 1857, "seagulls": 1858, "seal": 1859, "seals": 1860, "seasoned": 1861, "seasonings": 1862, "seat": 1863, "seaweed": 1864, "see": 1865, "seed": 1866, "seeds": 1867, "seem": 1868, "seems": 1869, "seen": 1870, "selling": 1871, "served": 1872, "serving": 1873, "shade": 1874, "shaggy": 1875, "shaker": 1876, "shakers": 1877, "shallow": 1878, "shampoo": 1879, "shampoos": 1880, "shape": 1881, "shapes": 1882, "shark": 1883, "sharks": 1884, "shaving": 1885, "she": 1886, "sheep": 1887, "sheep's": 1888, "sheet": 1889, "sheets": 1890, "shelf": 1891, "shelter": 1892, "shelves": 1893, "shield": 1894, "shields": 1895, "shining": 1896, "shiny": 1897, "ship": 1898, "ships": 1899, "shirt": 1900, "shirtless": 1901, "shirts": 1902, "shoe": 1903, "shoes": 1904, "shop": 1905, "shopper": 1906, "shoppers": 1907, "shopping": 1908, "shops": 1909, "shore": 1910, "short": 1911, "shorts": 1912, "shower": 1913, "showing": 1914, "shown": 1915, "shredded": 1916, "shrimp": 1917, "shrub": 1918, "shrubs": 1919, "shut": 1920, "shuttle": 1921, "shuttles": 1922, "side": 1923, "sidewalk": 1924, "sign": 1925, "signal": 1926, "signs": 1927, "silk": 1928, "silver": 1929, "silverware": 1930, "sink": 1931, "sinks": 1932, "sit": 1933, "sits": 1934, "sitting": 1935, "sitting-down": 1936, "size": 1937, "skate": 1938, "skateboard": 1939, "skateboarder": 1940, "skateboarders": 1941, "skateboarding": 1942, "skateboards": 1943, "skatepark": 1944, "skater": 1945, "skaters": 1946, "skating": 1947, "ski": 1948, "skier": 1949, "skiers": 1950, "skiing": 1951, "skillet": 1952, "skin": 1953, "skinny": 1954, "skirt": 1955, "skis": 1956, "sky": 1957, "skyscraper": 1958, "skyscrapers": 1959, "sleep": 1960, "sleeping": 1961, "sleeps": 1962, "sleeved": 1963, "sleeveless": 1964, "slice": 1965, "sliced": 1966, "slices": 1967, "slicing": 1968, "small": 1969, "smelling": 1970, "smiling": 1971, "smoke": 1972, "smoking": 1973, "smooth": 1974, "smoothie": 1975, "snack": 1976, "snacks": 1977, "snails": 1978, "snake": 1979, "snakes": 1980, "sneakers": 1981, "sniffing": 1982, "sniffs": 1983, "snow": 1984, "snowboard": 1985, "snowboarder": 1986, "snowboarders": 1987, "snowboarding": 1988, "snowboards": 1989, "snowpants": 1990, "snowsuit": 1991, "snowy": 1992, "soap": 1993, "soaps": 1994, "soccer": 1995, "sock": 1996, "socks": 1997, "soda": 1998, "sofa": 1999, "sofas": 2000, "soft": 2001, "soldier": 2002, "soldiers": 2003, "son": 2004, "sons": 2005, "soup": 2006, "sour": 2007, "sparse": 2008, "spatula": 2009, "spatulas": 2010, "speaker": 2011, "speakers": 2012, "spear": 2013, "species": 2014, "spectator": 2015, "spectators": 2016, "spice": 2017, "spices": 2018, "spider": 2019, "spiders": 2020, "spinach": 2021, "splashing": 2022, "sponge": 2023, "sponges": 2024, "spoon": 2025, "spoons": 2026, "spots": 2027, "spray": 2028, "spread": 2029, "sprinkled": 2030, "sprinkles": 2031, "square": 2032, "squash": 2033, "squashes": 2034, "squirrel": 2035, "squirrels": 2036, "stack": 2037, "stacked": 2038, "stadium": 2039, "stage": 2040, "stained": 2041, "stainless": 2042, "staircase": 2043, "stairs": 2044, "stand": 2045, "standing": 2046, "stands": 2047, "stapler": 2048, "star": 2049, "stare": 2050, "stares": 2051, "staring": 2052, "stars": 2053, "station": 2054, "statue": 2055, "statues": 2056, "steak": 2057, "steam": 2058, "steamed": 2059, "steel": 2060, "steering": 2061, "step": 2062, "steps": 2063, "stew": 2064, "stick": 2065, "sticker": 2066, "stickers": 2067, "sticks": 2068, "sticky": 2069, "still": 2070, "stir": 2071, "stone": 2072, "stones": 2073, "stool": 2074, "stools": 2075, "stop": 2076, "storage": 2077, "store": 2078, "stores": 2079, "stormy": 2080, "stove": 2081, "stoves": 2082, "straight": 2083, "straw": 2084, "strawberries": 2085, "strawberry": 2086, "street": 2087, "streetlight": 2088, "striped": 2089, "stroller": 2090, "strollers": 2091, "strong": 2092, "stuck": 2093, "student": 2094, "students": 2095, "stuffed": 2096, "stump": 2097, "sugar": 2098, "suit": 2099, "suitcase": 2100, "suitcases": 2101, "suits": 2102, "sun": 2103, "sunflower": 2104, "sunflowers": 2105, "sunglasses": 2106, "sunny": 2107, "surf": 2108, "surfboard": 2109, "surfboards": 2110, "surfer": 2111, "surfer's": 2112, "surfers": 2113, "surfing": 2114, "surround": 2115, "surrounded": 2116, "surrounding": 2117, "surrounds": 2118, "sushi": 2119, "suvs": 2120, "swan": 2121, "swans": 2122, "sweater": 2123, "sweatshirt": 2124, "sweet": 2125, "swim": 2126, "swimmer": 2127, "swimmers": 2128, "swimming": 2129, "swimsuit": 2130, "swing": 2131, "swinging": 2132, "swings": 2133, "switch": 2134, "sword": 2135, "symbol": 2136, "syrup": 2137, "t-shirt": 2138, "tabby": 2139, "table": 2140, "tablecloth": 2141, "tablecloths": 2142, "tables": 2143, "tablet": 2144, "tablets": 2145, "taco": 2146, "tacoes": 2147, "tag": 2148, "tags": 2149, "tail": 2150, "taken": 2151, "taking": 2152, "talk": 2153, "talking": 2154, "talks": 2155, "tall": 2156, "taller": 2157, "tan": 2158, "tangerine": 2159, "tangerines": 2160, "tank": 2161, "tap": 2162, "tape": 2163, "tasty": 2164, "taxi": 2165, "taxis": 2166, "tea": 2167, "teal": 2168, "team": 2169, "teddy": 2170, "tee": 2171, "teeth": 2172, "telephone": 2173, "television": 2174, "televisions": 2175, "temple": 2176, "tennis": 2177, "tent": 2178, "tents": 2179, "terminal": 2180, "textured": 2181, "than": 2182, "that": 2183, "the": 2184, "there": 2185, "these": 2186, "they": 2187, "thick": 2188, "thin": 2189, "thing": 2190, "think": 2191, "this": 2192, "those": 2193, "through": 2194, "throw": 2195, "throwing": 2196, "throws": 2197, "tie": 2198, "tied": 2199, "ties": 2200, "tiger": 2201, "tigers": 2202, "tiles": 2203, "tin": 2204, "tinted": 2205, "tiny": 2206, "tire": 2207, "tires": 2208, "tissue": 2209, "tissues": 2210, "to": 2211, "toast": 2212, "toasted": 2213, "toaster": 2214, "toasters": 2215, "toasts": 2216, "today": 2217, "toddler": 2218, "toddlers": 2219, "tofu": 2220, "toilet": 2221, "toiletries": 2222, "toilets": 2223, "tomato": 2224, "tomatoes": 2225, "tone": 2226, "tongs": 2227, "tool": 2228, "toolbox": 2229, "toolboxes": 2230, "tools": 2231, "toothbrush": 2232, "toothbrushes": 2233, "toothpaste": 2234, "toothpastes": 2235, "top": 2236, "topped": 2237, "topping": 2238, "toppings": 2239, "tortilla": 2240, "tortillas": 2241, "tossing": 2242, "touch": 2243, "touches": 2244, "touching": 2245, "tourist": 2246, "tourists": 2247, "toward": 2248, "towards": 2249, "towel": 2250, "towels": 2251, "tower": 2252, "towers": 2253, "towing": 2254, "town": 2255, "toy": 2256, "toys": 2257, "tracks": 2258, "tractor": 2259, "tractors": 2260, "traffic": 2261, "trailer": 2262, "trailers": 2263, "train": 2264, "trains": 2265, "trash": 2266, "trashcan": 2267, "traveling": 2268, "tray": 2269, "trays": 2270, "tree": 2271, "trees": 2272, "triangular": 2273, "trick": 2274, "trousers": 2275, "truck": 2276, "trucks": 2277, "trumpet": 2278, "trunk": 2279, "trunks": 2280, "trying": 2281, "tshirt": 2282, "tub": 2283, "tuna": 2284, "tunnel": 2285, "turkey": 2286, "turned": 2287, "turned-off": 2288, "turned-on": 2289, "turquoise": 2290, "turtle": 2291, "turtles": 2292, "twig": 2293, "twigs": 2294, "two": 2295, "tying": 2296, "type": 2297, "types": 2298, "typing": 2299, "ugly": 2300, "umbrella": 2301, "umbrellas": 2302, "umpire": 2303, "umpires": 2304, "uncomfortable": 2305, "uncooked": 2306, "under": 2307, "underneath": 2308, "undershirt": 2309, "underwear": 2310, "unhappy": 2311, "unhealthy": 2312, "uniform": 2313, "uniforms": 2314, "unlit": 2315, "unopened": 2316, "unpaved": 2317, "unpeeled": 2318, "unripe": 2319, "up": 2320, "upholstered": 2321, "upside": 2322, "urinal": 2323, "urinals": 2324, "used": 2325, "uses": 2326, "using": 2327, "utensil": 2328, "utensils": 2329, "utility": 2330, "vacuum": 2331, "van": 2332, "vanilla": 2333, "vans": 2334, "vase": 2335, "vases": 2336, "vegetable": 2337, "vegetables": 2338, "veggies": 2339, "vehicle": 2340, "vehicles": 2341, "vending": 2342, "vendor": 2343, "vendors": 2344, "venue": 2345, "vertical": 2346, "vest": 2347, "vests": 2348, "video": 2349, "village": 2350, "vine": 2351, "vines": 2352, "vintage": 2353, "visible": 2354, "visitors": 2355, "wading": 2356, "waffle": 2357, "waffles": 2358, "wagon": 2359, "wagons": 2360, "wait": 2361, "waiter": 2362, "waiters": 2363, "waiting": 2364, "waitress": 2365, "walk": 2366, "walking": 2367, "walks": 2368, "walkway": 2369, "wall": 2370, "wallet": 2371, "wallets": 2372, "wallpaper": 2373, "walls": 2374, "walnut": 2375, "walnuts": 2376, "wardrobe": 2377, "wardrobes": 2378, "warm": 2379, "was": 2380, "washer": 2381, "washing": 2382, "waste": 2383, "watch": 2384, "watches": 2385, "watching": 2386, "water": 2387, "watercraft": 2388, "waterfall": 2389, "watermelon": 2390, "watermelons": 2391, "wavy": 2392, "weapon": 2393, "wear": 2394, "wearing": 2395, "wears": 2396, "weather": 2397, "wedding": 2398, "weeds": 2399, "weight": 2400, "wet": 2401, "wetsuit": 2402, "wetsuits": 2403, "whale": 2404, "whales": 2405, "what": 2406, "what's": 2407, "wheel": 2408, "wheelchair": 2409, "wheelchairs": 2410, "wheels": 2411, "where": 2412, "which": 2413, "whipped": 2414, "whisk": 2415, "whisks": 2416, "white": 2417, "who": 2418, "wicker": 2419, "wide": 2420, "width": 2421, "wig": 2422, "wigs": 2423, "wiis": 2424, "wild": 2425, "wildflowers": 2426, "window": 2427, "windows": 2428, "wine": 2429, "wineglass": 2430, "wire": 2431, "wires": 2432, "with": 2433, "wok": 2434, "wolf": 2435, "wolves": 2436, "woman": 2437, "woman's": 2438, "women": 2439, "wood": 2440, "wooden": 2441, "wool": 2442, "word": 2443, "words": 2444, "work": 2445, "worker": 2446, "workers": 2447, "working": 2448, "worn": 2449, "wrapped": 2450, "wreath": 2451, "wrinkled": 2452, "wrist": 2453, "wristband": 2454, "wristwatch": 2455, "yard": 2456, "yellow": 2457, "yogurt": 2458, "you": 2459, "young": 2460, "younger": 2461, "zebra": 2462, "zebra's": 2463, "zebras": 2464, "zoo": 2465, "zucchini": 2466, "zucchinis": 2467}, "program_token_to_idx": {"<NULL>": 0, "<START>": 1, "<END>": 2, "<UNK>": 3, "0_select": 4, "1_choose": 5, "1_different": 6, "1_exist": 7, "1_filter": 8, "1_query": 9, "1_relateobj": 10, "1_relatesame": 11, "1_relatesbj": 12, "1_same": 13, "1_verify": 14, "2_and": 15, "2_choose": 16, "2_common": 17, "2_different": 18, "2_or": 19, "2_same": 20}, "operation_token_to_idx": {"<NULL>": 0, "<START>": 1, "<END>": 2, "<UNK>": 3, "": 4, "activity": 5, "age": 6, "brightness": 7, "cleanliness": 8, "color": 9, "company": 10, "depth": 11, "event": 12, "face_expression": 13, "fatness": 14, "flavor": 15, "gender": 16, "hardness": 17, "healthier": 18, "height": 19, "hposition": 20, "larger": 21, "length": 22, "less_healthy": 23, "liquid": 24, "location": 25, "lower": 26, "material": 27, "name": 28, "older": 29, "opaqness": 30, "orientation": 31, "pattern": 32, "place": 33, "pose": 34, "race": 35, "realism": 36, "relobj": 37, "relsbj": 38, "room": 39, "shape": 40, "shorter": 41, "size": 42, "smaller": 43, "sport": 44, "sportActivity": 45, "state": 46, "taller": 47, "texture": 48, "thickness": 49, "tone": 50, "type": 51, "vposition": 52, "weather": 53, "weight": 54, "width": 55, "younger": 56}, "answer_token_to_idx": {"<NULL>": 0, "<START>": 1, "<END>": 2, "<UNK>": 3, "above": 4, "action_figure": 5, "adidas": 6, "adult": 7, "ahead": 8, "air": 9, "air_conditioner": 10, "aircraft": 11, "airplane": 12, "airplanes": 13, "airport": 14, "alarm_clock": 15, "alcohol": 16, "alien": 17, "alligator": 18, "almond": 19, "almonds": 20, "aluminum": 21, "ambulance": 22, "american_flag": 23, "amusement_park": 24, "anchovies": 25, "angry": 26, "angry_bird": 27, "animal": 28, "antelope": 29, "antelopes": 30, "antenna": 31, "antennas": 32, "antique": 33, "apartment": 34, "apartment_building": 35, "appetizer": 36, "appetizers": 37, "apple": 38, "apple_logo": 39, "apples": 40, "apron": 41, "aquarium": 42, "armchair": 43, "armor": 44, "arrow": 45, "artichoke": 46, "artichokes": 47, "artwork": 48, "asian": 49, "asparagus": 50, "asphalt": 51, "at_the_camera": 52, "athlete": 53, "athletic_shoe": 54, "attic": 55, "audience": 56, "auditorium": 57, "avocado": 58, "avocados": 59, "away": 60, "baby": 61, "back": 62, "backpack": 63, "backpacks": 64, "backyard": 65, "bacon": 66, "bag": 67, "bagel": 68, "bagels": 69, "bags": 70, "baked": 71, "baker": 72, "bakery": 73, "baking_pan": 74, "baking_sheet": 75, "balcony": 76, "ball": 77, "balloon": 78, "balloons": 79, "balls": 80, "bamboo": 81, "banana": 82, "banana_bunch": 83, "banana_bunches": 84, "banana_peel": 85, "bananas": 86, "bandage": 87, "bandana": 88, "bar_stool": 89, "bar_stools": 90, "bare": 91, "barn": 92, "barrier": 93, "bartender": 94, "baseball": 95, "baseball_bat": 96, "baseball_bats": 97, "baseball_mitt": 98, "baseball_players": 99, "basil": 100, "basket": 101, "baskets": 102, "bat": 103, "bath_towel": 104, "bathroom": 105, "bathtub": 106, "bats": 107, "batter": 108, "batteries": 109, "battery": 110, "beach": 111, "beach_chair": 112, "beach_umbrella": 113, "beads": 114, "beans": 115, "bear": 116, "bears": 117, "beautiful": 118, "bed": 119, "bedding": 120, "bedroom": 121, "beds": 122, "bedspread": 123, "bee": 124, "beef": 125, "beer": 126, "beer_bottle": 127, "beer_can": 128, "beer_cans": 129, "beer_mug": 130, "beet": 131, "beets": 132, "behind": 133, "beige": 134, "bell": 135, "bell_tower": 136, "below": 137, "belt": 138, "bench": 139, "benches": 140, "bending": 141, "beneath": 142, "berries": 143, "berry": 144, "beverage": 145, "beverages": 146, "bicycle": 147, "bicycles": 148, "bike": 149, "biker": 150, "bikes": 151, "bikini": 152, "binder": 153, "bird": 154, "bird_cage": 155, "bird_house": 156, "birds": 157, "biscuit": 158, "biscuits": 159, "bison": 160, "black": 161, "black_and_white": 162, "blackberries": 163, "blanket": 164, "blankets": 165, "blazer": 166, "bleachers": 167, "blender": 168, "blenders": 169, "blind": 170, "blinds": 171, "blond": 172, "blood": 173, "blossom": 174, "blossoms": 175, "blouse": 176, "blue": 177, "blueberries": 178, "blueberry": 179, "boat": 180, "boats": 181, "bomb": 182, "bone": 183, "book": 184, "bookcase": 185, "books": 186, "bookshelf": 187, "bookshelves": 188, "boot": 189, "boots": 190, "bottle": 191, "bottles": 192, "bottom": 193, "boulders": 194, "bouquet": 195, "bowl": 196, "bowls": 197, "box": 198, "boxes": 199, "boy": 200, "boys": 201, "bracelet": 202, "bracelets": 203, "branch": 204, "branches": 205, "brass": 206, "bread": 207, "bread_box": 208, "bread_loaf": 209, "breakfast": 210, "brick": 211, "bricks": 212, "bridge": 213, "briefcase": 214, "broccoli": 215, "bronze": 216, "broom": 217, "broth": 218, "brown": 219, "brownie": 220, "brownies": 221, "brunette": 222, "brush": 223, "brushing_teeth": 224, "bubble": 225, "bubbles": 226, "bucket": 227, "bug": 228, "building": 229, "buildings": 230, "bull": 231, "bun": 232, "bunny": 233, "buns": 234, "buoy": 235, "buoys": 236, "burger": 237, "burner": 238, "burrito": 239, "bus": 240, "bus_driver": 241, "bus_stop": 242, "buses": 243, "bush": 244, "bushes": 245, "bushy": 246, "butter": 247, "butter_knife": 248, "butterflies": 249, "butterfly": 250, "cabbage": 251, "cabin": 252, "cabinet": 253, "cabinets": 254, "cable": 255, "cables": 256, "cactus": 257, "cafe": 258, "cafeteria": 259, "cage": 260, "cages": 261, "cake": 262, "cake_pan": 263, "cake_stand": 264, "cakes": 265, "calculator": 266, "calf": 267, "calm": 268, "camel": 269, "camera": 270, "cameras": 271, "can": 272, "candies": 273, "candle": 274, "candle_holder": 275, "candles": 276, "candy": 277, "cane": 278, "canister": 279, "canisters": 280, "canoe": 281, "canopy": 282, "cans": 283, "cap": 284, "cappuccino": 285, "car": 286, "caramel": 287, "card": 288, "cardboard": 289, "cards": 290, "carpet": 291, "carriage": 292, "carrot": 293, "carrots": 294, "cars": 295, "cart": 296, "carts": 297, "cash_register": 298, "casserole": 299, "castle": 300, "cat": 301, "cat_food": 302, "catcher": 303, "cathedral": 304, "cats": 305, "caucasian": 306, "cauliflower": 307, "cd": 308, "cds": 309, "ceiling": 310, "ceiling_light": 311, "celery": 312, "cell_phone": 313, "cell_phones": 314, "cemetery": 315, "ceramic": 316, "cereal": 317, "cereal_box": 318, "chain": 319, "chains": 320, "chair": 321, "chairs": 322, "chalkboard": 323, "champagne": 324, "chandelier": 325, "character": 326, "characters": 327, "charger": 328, "checkered": 329, "cheese": 330, "cheese_cube": 331, "cheeseburger": 332, "cheesecake": 333, "cheetah": 334, "chef": 335, "chef_hat": 336, "cherries": 337, "cherry": 338, "chicken": 339, "chicken_breast": 340, "chickens": 341, "chickpeas": 342, "child": 343, "children": 344, "chili": 345, "chimney": 346, "chinese_food": 347, "chocolate": 348, "chocolate_chips": 349, "choppy": 350, "chopstick": 351, "chopsticks": 352, "christmas_light": 353, "christmas_lights": 354, "chrome": 355, "church": 356, "cigar": 357, "cigarette": 358, "cinnamon": 359, "cinnamon_roll": 360, "city": 361, "classroom": 362, "clay": 363, "clean": 364, "clear": 365, "cliff": 366, "clock": 367, "clock_tower": 368, "clocks": 369, "closed": 370, "closet": 371, "cloth": 372, "cloths": 373, "cloudless": 374, "clouds": 375, "cloudy": 376, "coach": 377, "coarse": 378, "coat": 379, "coats": 380, "cobblestone": 381, "cockpit": 382, "coconut": 383, "coconuts": 384, "coffee": 385, "coffee_beans": 386, "coffee_cup": 387, "coffee_cups": 388, "coffee_maker": 389, "coffee_mug": 390, "coffee_pot": 391, "coffee_shop": 392, "coffee_table": 393, "coin": 394, "coke": 395, "coleslaw": 396, "collar": 397, "color": 398, "colorful": 399, "comb": 400, "comforter": 401, "computer": 402, "computer_desk": 403, "computer_monitor": 404, "computer_mouse": 405, "computers": 406, "concrete": 407, "cone": 408, "cones": 409, "console": 410, "container": 411, "containers": 412, "control_panel": 413, "controller": 414, "controllers": 415, "cookbook": 416, "cooked": 417, "cooker": 418, "cookie": 419, "cookie_dough": 420, "cookie_jar": 421, "cookies": 422, "cooking": 423, "cooking_pot": 424, "cooler": 425, "copper": 426, "cord": 427, "cords": 428, "corn": 429, "costume": 430, "cotton": 431, "cotton_candy": 432, "cotton_dessert": 433, "couch": 434, "couches": 435, "counter": 436, "countertop": 437, "couple": 438, "courtyard": 439, "covered": 440, "cow": 441, "cowboy": 442, "cowboy_hat": 443, "cows": 444, "crab": 445, "cracker": 446, "crackers": 447, "cranberries": 448, "cranberry": 449, "crane": 450, "crate": 451, "crates": 452, "cream": 453, "cream_cheese": 454, "cream_colored": 455, "cricket": 456, "croissant": 457, "croissants": 458, "cross": 459, "crosswalk": 460, "crouching": 461, "crowd": 462, "crown": 463, "crumbs": 464, "crust": 465, "crystal": 466, "cucumber": 467, "cucumbers": 468, "cup": 469, "cupboard": 470, "cupboards": 471, "cupcake": 472, "cupcakes": 473, "cups": 474, "curled": 475, "curly": 476, "curtain": 477, "curtains": 478, "curved": 479, "customer": 480, "customers": 481, "cutting_board": 482, "cyclist": 483, "daisy": 484, "dark": 485, "dark_blue": 486, "dark_brown": 487, "daughter": 488, "deck": 489, "decoration": 490, "decorations": 491, "deep": 492, "deer": 493, "denim": 494, "dense": 495, "desert": 496, "desk": 497, "desk_lamp": 498, "desktop_computer": 499, "dessert": 500, "desserts": 501, "diaper": 502, "dining_room": 503, "dining_table": 504, "dinner": 505, "dinosaur": 506, "dinosaurs": 507, "dip": 508, "dirt": 509, "dirty": 510, "dish": 511, "dish_drainer": 512, "dish_soap": 513, "dishes": 514, "dishwasher": 515, "dispenser": 516, "display": 517, "dock": 518, "dog": 519, "dog_food": 520, "dogs": 521, "doll": 522, "dolls": 523, "dolphin": 524, "dolphins": 525, "dome": 526, "donkey": 527, "donkeys": 528, "donut": 529, "donuts": 530, "door": 531, "door_frame": 532, "doors": 533, "doorway": 534, "dotted": 535, "dough": 536, "down": 537, "downward": 538, "dragon": 539, "dragons": 540, "drain": 541, "drape": 542, "drapes": 543, "drawer": 544, "drawers": 545, "drawing": 546, "drawings": 547, "dream_catcher": 548, "dress": 549, "dress_shirt": 550, "dresser": 551, "dresses": 552, "dressing": 553, "dried": 554, "drink": 555, "drinking": 556, "drinks": 557, "driver": 558, "driving": 559, "drum": 560, "dry": 561, "dry-erase_board": 562, "dryer": 563, "duck": 564, "ducks": 565, "dugout": 566, "dull": 567, "dumplings": 568, "dumpster": 569, "dvd_player": 570, "dvd_players": 571, "dvds": 572, "eagle": 573, "ear_buds": 574, "earphones": 575, "earring": 576, "earrings": 577, "eating": 578, "egg": 579, "egg_carton": 580, "egg_roll": 581, "egg_yolk": 582, "eggplant": 583, "eggs": 584, "eiffel_tower": 585, "elbow_pad": 586, "electric_toothbrush": 587, "elephant": 588, "elephants": 589, "elmo": 590, "employee": 591, "empty": 592, "end_table": 593, "engineer": 594, "entertainment_center": 595, "entrance": 596, "envelope": 597, "eye_glasses": 598, "face_mask": 599, "fake": 600, "family": 601, "fan": 602, "fans": 603, "farm": 604, "farmer": 605, "fat": 606, "father": 607, "faucet": 608, "feathers": 609, "feeder": 610, "female": 611, "fence": 612, "fence_post": 613, "feta_cheese": 614, 