{"label2idx": {"<NULL>": 0, "<UNK>": 1, "banana": 2, "spot": 3, "picnic": 4, "straw": 5, "meat": 6, "rice": 7, "onion": 8, "tablecloth": 9, "bowl": 10, "plantain": 11, "spoon": 12, "dish": 13, "meal": 14, "plate": 15, "tree": 16, "leaf": 17, "hat": 18, "boy": 19, "snow": 20, "ground": 21, "road": 22, "ski": 23, "foot": 24, "bush": 25, "hand": 26, "pole": 27, "twig": 28, "brush": 29, "water": 30, "branch": 31, "men": 32, "man": 33, "mud": 34, "dirt": 35, "boot": 36, "helmet": 37, "bike": 38, "tire": 39, "bag": 40, "grass": 41, "cake": 42, "faucet": 43, "window": 44, "cabinet": 45, "food": 46, "sofa": 47, "cereal box": 48, "decoration": 49, "counter": 50, "wall": 51, "blanket": 52, "wire": 53, "bicycle": 54, "cloud": 55, "sky": 56, "trailer": 57, "hotel": 58, "fence": 59, "paint": 60, "sign": 61, "rock": 62, "car": 63, "eye glass": 64, "shirt": 65, "watch": 66, "camera": 67, "toilet tank": 68, "mirror": 69, "guy": 70, "light switch": 71, "platform": 72, "building": 73, "street": 74, "people": 75, "shelter": 76, "tower": 77, "logo": 78, "wheel": 79, "truck": 80, "bench": 81, "head": 82, "hair": 83, "face": 84, "ocean": 85, "surfer": 86, "surfboard": 87, "short": 88, "hillside": 89, "person": 90, "tree trunk": 91, "leg": 92, "pant": 93, "glove": 94, "microwave": 95, "apron": 96, "kitchen": 97, "glass": 98, "fork": 99, "wine": 100, "post": 101, "number": 102, "tag": 103, "stove": 104, "ice": 105, "basket": 106, "pan": 107, "cow": 108, "barn": 109, "field": 110, "tail": 111, "roof": 112, "ear": 113, "container": 114, "knife": 115, "egg": 116, "eye": 117, "paw": 118, "dock": 119, "porch": 120, "nose": 121, "cat": 122, "neck": 123, "rope": 124, "cable": 125, "beach": 126, "wetsuit": 127, "keyboard": 128, "laptop": 129, "girl": 130, "collar": 131, "coffee cup": 132, "desk": 133, "computer": 134, "paper": 135, "ceiling": 136, "can": 137, "lid": 138, "figurine": 139, "office": 140, "cell phone": 141, "water bottle": 142, "chair": 143, "telephone pole": 144, "power line": 145, "tie": 146, "train": 147, "cone": 148, "railroad": 149, "train track": 150, "trash": 151, "graffiti": 152, "door": 153, "wing": 154, "airplane": 155, "walkway": 156, "runway": 157, "airport": 158, "word": 159, "elephant": 160, "picture": 161, "trunk": 162, "soap": 163, "floor": 164, "outlet": 165, "sink": 166, "toilet": 167, "drawer": 168, "bathroom": 169, "dispenser": 170, "countertop": 171, "device": 172, "roadway": 173, "pavement": 174, "box": 175, "intersection": 176, "house": 177, "crosswalk": 178, "arrow": 179, "puddle": 180, "salad": 181, "lunch": 182, "apple": 183, "table": 184, "lettuce": 185, "gravel": 186, "arm": 187, "mane": 188, "mouth": 189, "horn": 190, "giraffe": 191, "purse": 192, "lady": 193, "cap": 194, "boat": 195, "lemon": 196, "refrigerator": 197, "sidewalk": 198, "gate": 199, "beak": 200, "bird": 201, "tray": 202, "jacket": 203, "t-shirt": 204, "kite": 205, "street light": 206, "motorcycle": 207, "palm tree": 208, "woman": 209, "net": 210, "racket": 211, "seaweed": 212, "couple": 213, "clothes": 214, "cart": 215, "horse": 216, "seat": 217, "pipe": 218, "drink": 219, "cooler": 220, "goat": 221, "clock": 222, "pizza": 223, "tree branch": 224, "eagle": 225, "feather": 226, "train station": 227, "uniform": 228, "vegetable": 229, "bottle": 230, "flip flop": 231, "crowd": 232, "spectator": 233, "sheep": 234, "mountain": 235, "cliff": 236, "hill": 237, "frosting": 238, "sprinkle": 239, "cupcake": 240, "sauce": 241, "saucer": 242, "suitcase": 243, "plant": 244, "pepper": 245, "tomato": 246, "bean": 247, "bottle cap": 248, "liquid": 249, "carrot": 250, "pickle": 251, "wine glass": 252, "cheese": 253, "tile": 254, "potato": 255, "bone": 256, "garnish": 257, "gravy": 258, "beverage": 259, "bubble": 260, "zebra": 261, "traffic light": 262, "hot dog": 263, "roll": 264, "cup": 265, "coffee": 266, "skillet": 267, "book": 268, "spatula": 269, "mushroom": 270, "computer mouse": 271, "doll": 272, "shelf": 273, "bear": 274, "bucket": 275, "skier": 276, "tool": 277, "brick": 278, "outfit": 279, "umbrella": 280, "parking meter": 281, "display": 282, "chain": 283, "bandana": 284, "monkey": 285, "jean": 286, "necklace": 287, "frisbee": 288, "bracelet": 289, "player": 290, "ball": 291, "jersey": 292, "dress": 293, "wrist": 294, "skateboard": 295, "flag": 296, "dome": 297, "scissors": 298, "card": 299, "frame": 300, "napkin": 301, "backpack": 302, "suit": 303, "vehicle": 304, "cyclist": 305, "chimney": 306, "hedge": 307, "lawn": 308, "sun": 309, "seed": 310, "parmesan cheese": 311, "flower": 312, "toilet brush": 313, "parking lot": 314, "pocket": 315, "park": 316, "shoe": 317, "rug": 318, "menu": 319, "chopstick": 320, "broccoli": 321, "propeller": 322, "stair": 323, "stop sign": 324, "weed": 325, "letter": 326, "paint brush": 327, "mat": 328, "screen": 329, "pen": 330, "phone": 331, "coat": 332, "license plate": 333, "bun": 334, "taxi": 335, "dog": 336, "polar bear": 337, "log": 338, "step": 339, "bus": 340, "sticker": 341, "windshield": 342, "feeder": 343, "cage": 344, "fire hydrant": 345, "shore": 346, "buoy": 347, "van": 348, "cane": 349, "comb": 350, "carriage": 351, "sign post": 352, "apartment": 353, "lip": 354, "mustache": 355, "street sign": 356, "city": 357, "monster": 358, "driver": 359, "child": 360, "sweater": 361, "tongue": 362, "statue": 363, "pillar": 364, "ham": 365, "microphone": 366, "machine": 367, "cord": 368, "symbol": 369, "blind": 370, "towel": 371, "lamp": 372, "tissue": 373, "toaster": 374, "mug": 375, "pot": 376, "sand": 377, "sail": 378, "bread": 379, "strawberry": 380, "sweatshirt": 381, "train car": 382, "student": 383, "classroom": 384, "drawing": 385, "rooftop": 386, "station": 387, "bridge": 388, "smoke": 389, "ladder": 390, "locomotive": 391, "entrance": 392, "sock": 393, "stadium": 394, "bleacher": 395, "waist": 396, "life jacket": 397, "tank top": 398, "skin": 399, "artwork": 400, "sneaker": 401, "stage": 402, "alien": 403, "bell tower": 404, "cross": 405, "bell": 406, "balcony": 407, "crust": 408, "spinach": 409, "topping": 410, "chicken": 411, "magazine": 412, "baby": 413, "doorway": 414, "museum": 415, "room": 416, "label": 417, "toilet seat": 418, "catcher": 419, "pitcher": 420, "wristband": 421, "belt": 422, "dresser": 423, "nightstand": 424, "light fixture": 425, "bookcase": 426, "bed": 427, "zoo": 428, "hay": 429, "garden": 430, "deck": 431, "olive": 432, "path": 433, "name tag": 434, "planter": 435, "suv": 436, "stick": 437, "asparagus": 438, "fruit": 439, "orange": 440, "sausage": 441, "obstacle": 442, "poster": 443, "coffee table": 444, "heater": 445, "couch": 446, "pillow": 447, "remote control": 448, "tape": 449, "lock": 450, "apple logo": 451, "controller": 452, "carpet": 453, "sheet": 454, "toy": 455, "door frame": 456, "curtain": 457, "town": 458, "speaker": 459, "monitor": 460, "headphone": 461, "printer": 462, "mouse pad": 463, "garage": 464, "appliance": 465, "mailbox": 466, "bacon": 467, "silverware": 468, "shrimp": 469, "frog": 470, "utensil": 471, "butter": 472, "raspberry": 473, "butterfly": 474, "cutting board": 475, "island": 476, "fog": 477, "crane": 478, "jet": 479, "family": 480, "river": 481, "sandal": 482, "duck": 483, "ostrich": 484, "end table": 485, "ring": 486, "fur": 487, "goggles": 488, "sandwich": 489, "headband": 490, "newspaper": 491, "air": 492, "tree leaf": 493, "bookshelf": 494, "ice maker": 495, "soldier": 496, "earring": 497, "lamb": 498, "animal": 499, "farm": 500, "mask": 501, "game": 502, "home plate": 503, "baseball": 504, "beard": 505, "plain": 506, "knee pad": 507, "vest": 508, "lamp shade": 509, "living room": 510, "television": 511, "entertainment center": 512, "robe": 513, "toiletry": 514, "candle": 515, "bathtub": 516, "drain": 517, "dugout": 518, "bat": 519, "shop": 520, "bus stop": 521, "waterfall": 522, "basil": 523, "pepperoni": 524, "snowboard": 525, "heart": 526, "finger": 527, "wagon": 528, "wii controller": 529, "salt": 530, "celery": 531, "oven": 532, "tent": 533, "bull": 534, "sugar": 535, "toast": 536, "salt shaker": 537, "coach": 538, "umpire": 539, "vase": 540, "shower door": 541, "skirt": 542, "hilltop": 543, "wine bottle": 544, "spice": 545, "cabinet door": 546, "burner": 547, "gun": 548, "policeman": 549, "restaurant": 550, "staircase": 551, "briefcase": 552, "blender": 553, "soccer ball": 554, "magnet": 555, "teddy bear": 556, "picnic table": 557, "stuffed bear": 558, "grill": 559, "snow pant": 560, "robot": 561, "projector": 562, "underwear": 563, "bead": 564, "goose": 565, "ottoman": 566, "scooter": 567, "gorilla": 568, "pond": 569, "cucumber": 570, "nut": 571, "squash": 572, "coffee maker": 573, "painting": 574, "baseball bat": 575, "stone": 576, "moss": 577, "star": 578, "beer": 579, "jar": 580, "coffee mug": 581, "swimsuit": 582, "paddle": 583, "ambulance": 584, "juice": 585, "forest": 586, "flame": 587, "sunglass": 588, "canister": 589, "control panel": 590, "teeth": 591, "computer monitor": 592, "piercing": 593, "batter": 594, "picture frame": 595, "donut": 596, "owl": 597, "paper towel": 598, "herd": 599, "parent": 600, "jockey": 601, "platter": 602, "wool": 603, "tennis ball": 604, "legging": 605, "toilet bowl": 606, "trash can": 607, "trash bag": 608, "fan": 609, "team": 610, "face mask": 611, "mound": 612, "toothbrush": 613, "fish": 614, "dressing": 615, "burger": 616, "donkey": 617, "pilot": 618, "cockpit": 619, "skate park": 620, "tongs": 621, "toothpick": 622, "pastry": 623, "ski lift": 624, "manhole cover": 625, "router": 626, "calculator": 627, "charger": 628, "cabin": 629, "lake": 630, "vine": 631, "notepad": 632, "thumb": 633, "raincoat": 634, "peach": 635, "berry": 636, "wristwatch": 637, "glaze": 638, "barrier": 639, "hangar": 640, "light bulb": 641, "crate": 642, "fountain": 643, "antenna": 644, "yard": 645, "fence post": 646, "shoe lace": 647, "chocolate": 648, "powder": 649, "dough": 650, "calf": 651, "shield": 652, "chalkboard": 653, "pajama": 654, "character": 655, "comforter": 656, "headboard": 657, "canoe": 658, "french toast": 659, "pine tree": 660, "tissue box": 661, "diaper": 662, "gown": 663, "candy": 664, "foil": 665, "cooky": 666, "cherry": 667, "dessert": 668, "lime": 669, "croissant": 670, "scarf": 671, "chef": 672, "snowsuit": 673, "pasture": 674, "cream": 675, "clock tower": 676, "chandelier": 677, "scrub brush": 678, "skater": 679, "oven door": 680, "cupboard": 681, "skyscraper": 682, "desk lamp": 683, "patio": 684, "garlic": 685, "pepper shaker": 686, "sack": 687, "canopy": 688, "sailboat": 689, "harbor": 690, "spray can": 691, "binder": 692, "notebook": 693, "balloon": 694, "video game": 695, "dvd": 696, "baseball mitt": 697, "marker": 698, "egg yolk": 699, "fire extinguisher": 700, "shower": 701, "terminal": 702, "passenger": 703, "store": 704, "american flag": 705, "athletic shoe": 706, "fireplace": 707, "cowboy": 708, "pea": 709, "boulder": 710, "wii": 711, "church": 712, "kiwi": 713, "sculpture": 714, "beef": 715, "tea": 716, "dining table": 717, "stump": 718, "coin": 719, "rose": 720, "fire": 721, "flower pot": 722, "hand soap": 723, "steering wheel": 724, "cauliflower": 725, "undershirt": 726, "toy car": 727, "urinal": 728, "bouquet": 729, "pasta": 730, "medicine cabinet": 731, "soap dish": 732, "photographer": 733, "traffic sign": 734, "goal": 735, "pizza slice": 736, "hose": 737, "gas pump": 738, "pump": 739, "coke": 740, "garage door": 741, "folding chair": 742, "pencil": 743, "envelope": 744, "ipod": 745, "customer": 746, "merchandise": 747, "ketchup": 748, "coleslaw": 749, "moon": 750, "backyard": 751, "coconut": 752, "scaffolding": 753, "paper container": 754, "bath towel": 755, "pineapple": 756, "floor lamp": 757, "computer desk": 758, "drape": 759, "blossom": 760, "packet": 761, "handbag": 762, "mother": 763, "tunnel": 764, "steam": 765, "candle holder": 766, "game controller": 767, "olive oil": 768, "father": 769, "pizza pan": 770, "herb": 771, "cd": 772, "armchair": 773, "office chair": 774, "fry": 775, "broom": 776, "radiator": 777, "shopping bag": 778, "bedroom": 779, "cemetery": 780, "grape": 781, "aquarium": 782, "tattoo": 783, "peanut butter": 784, "squirrel": 785, "luggage": 786, "life preserver": 787, "sponge": 788, "dish soap": 789, "side table": 790, "dining room": 791, "soda bottle": 792, "snowboarder": 793, "gas station": 794, "pigeon": 795, "satellite dish": 796, "piano": 797, "knife block": 798, "blouse": 799, "swimming pool": 800, "desert": 801, "toilet paper": 802, "earphone": 803, "bedding": 804, "shower curtain": 805, "football": 806, "dishwasher": 807, "crown": 808, "stuffed animal": 809, "mustard": 810, "water glass": 811, "stroller": 812, "pedestrian": 813, "sea": 814, "hallway": 815, "drum": 816, "cracker": 817, "pork": 818, "ornament": 819, "eiffel tower": 820, "rubber duck": 821, "pear": 822, "avocado": 823, "crumb": 824, "raisin": 825, "elbow pad": 826, "corn": 827, "hook": 828, "waste basket": 829, "minute hand": 830, "hour hand": 831, "wallpaper": 832, "sugar packet": 833, "pancake": 834, "ketchup bottle": 835, "syrup": 836, "mixing bowl": 837, "rolling pin": 838, "ladle": 839, "cake pan": 840, "puppy": 841, "soup": 842, "worker": 843, "employee": 844, "hotdog bun": 845, "leopard": 846, "broth": 847, "keypad": 848, "toilet lid": 849, "beet": 850, "cabbage": 851, "sea foam": 852, "seal": 853, "alarm clock": 854, "bedspread": 855, "sweet potato": 856, "snow boot": 857, "clock hand": 858, "minivan": 859, "shopping cart": 860, "soap dispenser": 861, "cheeseburger": 862, "heel": 863, "receipt": 864, "closet": 865, "stir fry": 866, "pouch": 867, "gadget": 868, "meatball": 869, "guitar": 870, "dip": 871, "dress shirt": 872, "kiosk": 873, "sour cream": 874, "burrito": 875, "tomato sauce": 876, "costume": 877, "grater": 878, "kettle": 879, "biker": 880, "egg white": 881, "can opener": 882, "bus driver": 883, "air conditioner": 884, "watermelon": 885, "rhino": 886, "officer": 887, "potato chip": 888, "son": 889, "soda": 890, "soft drink": 891, "roadside": 892, "salmon": 893, "ship": 894, "smoke stack": 895, "toothpaste": 896, "fire truck": 897, "rib": 898, "gentleman": 899, "beach chair": 900, "window frame": 901, "jeep": 902, "dryer": 903, "bagel": 904, "spray bottle": 905, "oil": 906, "audience": 907, "deer": 908, "cigarette": 909, "ceiling light": 910, "kitten": 911, "highway": 912, "zucchini": 913, "tofu": 914, "noodle": 915, "whipped cream": 916, "wallet": 917, "blood": 918, "console": 919, "gas stove": 920, "plier": 921, "snack": 922, "cafeteria": 923, "dinner": 924, "blueberry": 925, "blackberry": 926, "radio": 927, "butter knife": 928, "milk": 929, "bikini": 930, "map": 931, "jewelry": 932, "package": 933, "pizza cutter": 934, "flour": 935, "pizza oven": 936, "courtyard": 937, "elevator": 938, "icing": 939, "penguin": 940, "mixer": 941, "attic": 942, "castle": 943, "blazer": 944, "figure": 945, "shopping center": 946, "instrument": 947, "coffee pot": 948, "aircraft": 949, "rain": 950, "skateboarder": 951, "breakfast": 952, "mickey mouse": 953, "powdered sugar": 954, "seafood": 955, "polo shirt": 956, "wii game": 957, "tea pot": 958, "action figure": 959, "mountain side": 960, "market": 961, "price tag": 962, "athlete": 963, "shuttle": 964, "camel": 965, "tourist": 966, "baking pan": 967, "soda can": 968, "milk carton": 969, "cereal": 970, "placemat": 971, "hamburger": 972, "eggplant": 973, "kangaroo": 974, "garland": 975, "mozzarella": 976, "antelope": 977, "fishing pole": 978, "bird cage": 979, "turkey": 980, "vas": 981, "panda": 982, "beer bottle": 983, "apartment building": 984, "tortilla": 985, "lipstick": 986, "mashed potato": 987, "wheelchair": 988, "christmas light": 989, "mattress": 990, "dragonfly": 991, "sword": 992, "auditorium": 993, "panda bear": 994, "produce": 995, "cooker": 996, "bug": 997, "video camera": 998, "hair dryer": 999, "village": 1000, "table lamp": 1001, "electric toothbrush": 1002, "mannequin": 1003, "shopper": 1004, "pumpkin": 1005, "restroom": 1006, "bird house": 1007, "match": 1008, "parachute": 1009, "tv stand": 1010, "ravioli": 1011, "vending machine": 1012, "dream catcher": 1013, "tablet": 1014, "cinnamon roll": 1015, "cloth": 1016, "pie": 1017, "wig": 1018, "toolbox": 1019, "lounge": 1020, "chef hat": 1021, "wok": 1022, "trumpet": 1023, "swan": 1024, "napkin dispenser": 1025, "chinese food": 1026, "wildflower": 1027, "macaroni": 1028, "pub": 1029, "banana peel": 1030, "tea kettle": 1031, "egg roll": 1032, "serving tray": 1033, "yogurt": 1034, "lighthouse": 1035, "seagull": 1036, "toaster oven": 1037, "touchpad": 1038, "ice cube": 1039, "lion": 1040, "appetizer": 1041, "beer mug": 1042, "brownie": 1043, "caramel": 1044, "meadow": 1045, "dvd player": 1046, "pillowcase": 1047, "mango": 1048, "ice cream": 1049, "walnut": 1050, "oak tree": 1051, "safety jacket": 1052, "dinosaur": 1053, "baked good": 1054, "muffin": 1055, "cappuccino": 1056, "cake stand": 1057, "tractor": 1058, "mall": 1059, "ginger": 1060, "pizza crust": 1061, "dolphin": 1062, "jumpsuit": 1063, "parking sign": 1064, "mountain peak": 1065, "rabbit": 1066, "peanut": 1067, "baking sheet": 1068, "factory": 1069, "riding boot": 1070, "shampoo bottle": 1071, "bread box": 1072, "bandage": 1073, "grocery": 1074, "microwave oven": 1075, "visitor": 1076, "lobster": 1077, "melon": 1078, "cathedral": 1079, "luggage cart": 1080, "cookie": 1081, "parsley": 1082, "sconce": 1083, "bread loaf": 1084, "artichoke": 1085, "food truck": 1086, "smoothie": 1087, "stapler": 1088, "armor": 1089, "storage box": 1090, "salad dressing": 1091, "pill": 1092, "onion ring": 1093, "chili": 1094, "moose": 1095, "toddler": 1096, "feta cheese": 1097, "omelette": 1098, "daisy": 1099, "parrot": 1100, "honey": 1101, "buffet": 1102, "vinegar": 1103, "spider": 1104, "banana bunch": 1105, "fruit stand": 1106, "hurdle": 1107, "dumpling": 1108, "cafe": 1109, "tiger": 1110, "octopus": 1111, "hair clip": 1112, "pizza pie": 1113, "hard drive": 1114, "bar stool": 1115, "vendor": 1116, "papaya": 1117, "waiter": 1118, "tangerine": 1119, "roast beef": 1120, "popcorn": 1121, "hotel room": 1122, "cowboy hat": 1123, "turbine": 1124, "pecan": 1125, "cinnamon": 1126, "mexican food": 1127, "dragon": 1128, "granola": 1129, "oatmeal": 1130, "utensil holder": 1131, "pizza shop": 1132, "grapefruit": 1133, "ear bud": 1134, "juice box": 1135, "anchovy": 1136, "temple": 1137, "orchid": 1138, "engineer": 1139, "xbox controller": 1140, "cream cheese": 1141, "bomb": 1142, "pig": 1143, "pesto": 1144, "gym": 1145, "hammer": 1146, "washing machine": 1147, "hospital": 1148, "lego": 1149, "cash register": 1150, "poodle": 1151, "coffee shop": 1152, "liquor": 1153, "baseball player": 1154, "office supply": 1155, "crab": 1156, "alligator": 1157, "home": 1158, "soap bottle": 1159, "pocket watch": 1160, "seat belt": 1161, "paper dispenser": 1162, "helicopter": 1163, "dumpster": 1164, "hairbrush": 1165, "vacuum": 1166, "shampoo": 1167, "casserole": 1168, "food container": 1169, "bartender": 1170, "cactus": 1171, "peacock": 1172, "fisherman": 1173, "cigar": 1174, "food processor": 1175, "whisk": 1176, "waffle": 1177, "dog food": 1178, "nutella": 1179, "towel dispenser": 1180, "soccer player": 1181, "mint": 1182, "theater": 1183, "spear": 1184, "garment": 1185, "waitress": 1186, "cheetah": 1187, "wolf": 1188, "sunflower": 1189, "bunny": 1190, "dry-erase board": 1191, "pomegranate": 1192, "turtle": 1193, "gift": 1194, "snail": 1195, "accessory": 1196, "stew": 1197, "lobby": 1198, "cooking pot": 1199, "alcohol": 1200, "school bus": 1201, "snow shoe": 1202, "guacamole": 1203, "champagne": 1204, "grinder": 1205, "battery": 1206, "cooking oil": 1207, "mustard bottle": 1208, "bee": 1209, "school": 1210, "nest": 1211, "mayonnaise": 1212, "chicken breast": 1213, "steak": 1214, "lily": 1215, "cat food": 1216, "shark": 1217, "supermarket": 1218, "potato salad": 1219, "hand dryer": 1220, "beach umbrella": 1221, "orchard": 1222, "kitchen towel": 1223, "entree": 1224, "marina": 1225, "biscuit": 1226, "snoopy": 1227, "dish drainer": 1228, "lizard": 1229, "pizza tray": 1230, "pizza box": 1231, "whale": 1232, "sticky note": 1233, "elmo": 1234, "hippo": 1235, "library": 1236, "snow flake": 1237, "milkshake": 1238, "stuffed dog": 1239, "rifle": 1240, "pasta salad": 1241, "shaving cream": 1242, "desktop computer": 1243, "pita": 1244, "hummus": 1245, "bison": 1246, "baker": 1247, "almond": 1248, "ingredient": 1249, "chocolate chip": 1250, "flamingo": 1251, "cookie jar": 1252, "money": 1253, "daughter": 1254, "cooking utensil": 1255, "performer": 1256, "pantry": 1257, "cranberry": 1258, "snake": 1259, "tuna": 1260, "kimono": 1261, "rice cooker": 1262, "bakery": 1263, "egg carton": 1264, "sushi": 1265, "cookie dough": 1266, "pistachio": 1267, "ramekin": 1268, "egg shell": 1269, "wedding": 1270, "amusement park": 1271, "swamp": 1272, "salon": 1273, "palace": 1274, "beer can": 1275, "chickpea": 1276, "marshmallow": 1277, "thermometer": 1278, "lemonade": 1279, "ice-cream cone": 1280, "lab coat": 1281, "cotton candy": 1282, "loaf": 1283, "cheesecake": 1284, "cookbook": 1285, "coral": 1286, "beetle": 1287, "coffee bean": 1288, "pretzel": 1289, "cotton dessert": 1290, "guest": 1291, "vanilla": 1292, "pudding": 1293, "wardrobe": 1294, "boar": 1295, "weapon": 1296, "fudge": 1297, "horse hoof": 1298, "farmer": 1299, "angry bird": 1300, "gourd": 1301, "gummy bear": 1302, "flatbread": 1303, "lunch box": 1304, "taco": 1305, "chess piece": 1306, "serving dish": 1307, "oreo": 1308, "swimmer": 1309, "hibiscus": 1310, "vitamin": 1311, "cheese cube": 1312}, "attr2idx": {"<UNK>": 0, "<NULL>": 1, "beige": 2, "black": 3, "blond": 4, "blue": 5, "brown": 6, "brunette": 7, "cream colored": 8, "dark blue": 9, "dark brown": 10, "gold": 11, "gray": 12, "green": 13, "khaki": 14, "light blue": 15, "light brown": 16, "maroon": 17, "orange": 18, "pink": 19, "purple": 20, "red": 21, "silver": 22, "tan": 23, "teal": 24, "white": 25, "yellow": 26, "aluminum": 27, "asphalt": 28, "bamboo": 29, "brass": 30, "brick": 31, "bronze": 32, "cardboard": 33, "chrome": 34, "clay": 35, "cloth": 36, "cobblestone": 37, "concrete": 38, "copper": 39, "cotton": 40, "crystal": 41, "denim": 42, "glass": 43, "granite": 44, "hardwood": 45, "iron": 46, "lace": 47, "leather": 48, "marble": 49, "mesh": 50, "metal": 51, "paper": 52, "plastic": 53, "porcelain": 54, "rock": 55, "rubber": 56, "silk": 57, "stainless steel": 58, "steel": 59, "stone": 60, "straw": 61, "styrofoam": 62, "tin": 63, "wicker": 64, "wire": 65, "wood": 66, "wool": 67, "giant": 68, "huge": 69, "large": 70, "little": 71, "small": 72, "tiny": 73, "cooking": 74, "drinking": 75, "driving": 76, "eating": 77, "having meeting": 78, "looking down": 79, "looking up": 80, "playing": 81, "posing": 82, "reading": 83, "resting": 84, "sleeping": 85, "staring": 86, "talking": 87, "waiting": 88, "indoors": 89, "outdoors": 90, "outdoor": 91, "bathroom": 92, "kitchen": 93, "ocean": 94, "office": 95, "park": 96, "plain": 97, "railroad": 98, "street": 99, "octagonal": 100, "rectangular": 101, "round": 102, "square": 103, "triangular": 104, "clear": 105, "cloudless": 106, "cloudy": 107, "foggy": 108, "overcast": 109, "partly cloudy": 110, "rainy": 111, "stormy": 112, "sunny": 113, "opaque": 114, "murky": 115, "long": 116, "short": 117, "narrow": 118, "wide": 119, "short2": 120, "tall": 121, "heavy": 122, "light": 123, "female": 124, "male": 125, "little2": 126, "old": 127, "young": 128, "new": 129, "calm": 130, "choppy": 131, "rough": 132, "smooth": 133, "still": 134, "wavy": 135, "clean": 136, "dirty": 137, "stained": 138, "tinted": 139, "angry": 140, "happy": 141, "sad": 142, "unhappy": 143, "asian": 144, "caucasian": 145, "dark": 146, "light2": 147, "bending": 148, "crouching": 149, "jumping": 150, "lying": 151, "pointing": 152, "running": 153, "sitting": 154, "standing": 155, "walking": 156, "fat": 157, "skinny": 158, "thin": 159, "thick": 160, "deep": 161, "shallow": 162, "checkered": 163, "dotted": 164, "striped": 165, "baseball": 166, "performing trick": 167, "riding": 168, "skateboarding": 169, "skating": 170, "ski": 171, "skiing": 172, "snowboarding": 173, "soccer": 174, "surfing": 175, "swimming": 176, "tennis": 177, "cheese": 178, "chocolate": 179, "strawberry": 180, "vanilla": 181, "horizontal": 182, "vertical": 183, "hard": 184, "soft": 185, "coarse": 186, "fine": 187, "adidas": 188, "nike": 189, "fake": 190, "real": 191, "beer": 192, "coffee": 193, "soda": 194, "water": 195, "wine": 196, "birthday": 197, "christmas": 198, "wedding": 199, "abundant": 200, "scarce": 201, "adult": 202, "baby": 203, "antique": 204, "modern": 205, "vintage": 206, "old fashioned": 207, "apple": 208, "banana": 209, "tomato": 210, "baked": 211, "cooked": 212, "uncooked": 213, "raw": 214, "fried": 215, "grilled": 216, "roasted": 217, "steamed": 218, "toasted": 219, "bare": 220, "leafy": 221, "bushy": 222, "leafless": 223, "lush": 224, "covered": 225, "snowy": 226, "sandy": 227, "grassy": 228, "rocky": 229, "beautiful": 230, "ugly": 231, "black and white": 232, "colorful": 233, "rainbow colored": 234, "bright": 235, "dull": 236, "closed": 237, "open": 238, "shut": 239, "comfortable": 240, "uncomfortable": 241, "complete": 242, "incomplete": 243, "curled": 244, "curly": 245, "straight": 246, "curved": 247, "rounded": 248, "curvy": 249, "dense": 250, "sparse": 251, "down": 252, "up": 253, "dried": 254, "dry": 255, "wet": 256, "empty": 257, "full": 258, "folded": 259, "folding": 260, "fresh": 261, "rotten": 262, "frozen": 263, "melted": 264, "melting": 265, "healthy": 266, "unhealthy": 267, "high": 268, "low": 269, "immature": 270, "mature": 271, "irregular": 272, "regular": 273, "lit": 274, "unlit": 275, "long sleeved": 276, "short sleeved": 277, "sleeveless": 278, "off": 279, "on": 280, "paved": 281, "unpaved": 282, "peeled": 283, "unpeeled": 284, "potted": 285, "wild": 286, "ripe": 287, "unripe": 288, "wired": 289, "wireless": 290, "delicious": 291, "piled": 292, "framed": 293, "electric": 294, "shirtless": 295, "splashing": 296, "crouched": 297, "grouped": 298, "scrambled": 299, "used": 300, "pale": 301, "plaid": 302, "faded": 303, "parked": 304, "shining": 305, "tiled": 306, "rolled": 307, "mounted": 308, "speckled": 309, "painted": 310, "cracked": 311, "shiny": 312, "pretty": 313, "cut": 314, "pointy": 315, "tied": 316, "barefoot": 317, "hanging": 318, "perched": 319, "overhead": 320, "flying": 321, "mowed": 322, "feathered": 323, "chain-link": 324, "artificial": 325, "sliced": 326, "burnt": 327, "reflective": 328, "juicy": 329, "ceramic": 330, "shredded": 331, "crumpled": 332, "smiling": 333, "shaved": 334, "grated": 335, "woven": 336, "flat": 337, "displayed": 338, "assorted": 339, "busy": 340, "tight": 341, "fuzzy": 342, "furry": 343, "upper": 344, "puffy": 345, "docked": 346, "fire": 347, "double decker": 348, "raised": 349, "sunlit": 350, "elevated": 351, "electronic": 352, "attached": 353, "athletic": 354, "wrapped": 355, "wrinkled": 356, "lighted": 357, "illuminated": 358, "crispy": 359, "textured": 360, "decorative": 361, "bent": 362, "elderly": 363, "balding": 364, "diamond": 365, "scattered": 366, "hairy": 367, "light colored": 368, "glowing": 369, "patchy": 370, "stacked": 371, "loose": 372, "oriental": 373, "digital": 374, "rusty": 375, "chopped": 376, "halved": 377, "designed": 378, "ornate": 379, "telephone": 380, "arched": 381, "barbed": 382, "tilted": 383, "simple": 384, "blurry": 385, "messy": 386, "grazing": 387, "fluffy": 388, "wispy": 389, "decorated": 390, "floral": 391, "reflected": 392, "winter": 393, "wooded": 394, "iced": 395, "filled": 396, "padded": 397, "safety": 398, "shingled": 399, "power": 400, "flowered": 401, "chinese": 402, "stuffed": 403, "gloved": 404, "translucent": 405, "hazy": 406, "abstract": 407, "hollow": 408, "outstretched": 409, "evergreen": 410, "kneeling": 411, "patterned": 412, "sharp": 413, "worn": 414, "dusty": 415, "warm": 416, "shaded": 417, "fenced": 418, "protective": 419, "blowing": 420, "braided": 421, "half full": 422, "dark colored": 423, "professional": 424, "chipped": 425, "blooming": 426, "creamy": 427, "gravel": 428, "bald": 429, "fallen": 430, "floating": 431, "tropical": 432, "sliding": 433, "manicured": 434, "glazed": 435, "swinging": 436, "rippled": 437, "overgrown": 438, "tangled": 439, "twisted": 440, "barren": 441, "navy": 442, "sturdy": 443, "alert": 444, "shaped": 445, "broken": 446, "polished": 447, "collared": 448, "sloped": 449, "pepper": 450, "analog": 451, "spiral": 452, "crooked": 453, "toy": 454, "strong": 455, "waving": 456, "american": 457, "foamy": 458, "pulled back": 459, "torn": 460, "soap": 461, "rugged": 462, "traffic": 463, "mixed": 464, "sheer": 465, "fancy": 466, "spraying": 467, "oversized": 468, "written": 469, "floppy": 470, "cushioned": 471, "ornamental": 472, "jagged": 473, "knit": 474, "breakable": 475, "frosted": 476, "blank": 477, "transparent": 478, "homemade": 479, "made": 480, "carpeted": 481, "edged": 482, "bunched": 483, "angled": 484, "gas": 485, "palm": 486, "laughing": 487, "browned": 488, "french": 489, "tasty": 490, "neat": 491, "funny": 492, "crossed": 493, "tabby": 494, "neon": 495, "paneled": 496, "turned": 497, "upside down": 498, "cluttered": 499, "seasoned": 500, "plush": 501, "crumbled": 502, "disposable": 503, "toilet": 504, "support": 505, "dangling": 506, "trimmed": 507, "computer": 508, "pine": 509, "wrist": 510, "portable": 511, "crashing": 512, "garbage": 513, "peeling": 514, "muddy": 515, "sprinkled": 516, "crowded": 517, "snow": 518, "packaged": 519, "sweet": 520, "packed": 521, "ridged": 522, "carved": 523, "hitting": 524, "deciduous": 525, "miniature": 526, "directional": 527, "diced": 528, "powdered": 529, "tail": 530, "public": 531, "domed": 532, "crisp": 533, "commercial": 534, "drawn": 535, "rippling": 536, "jean": 537, "sculpted": 538, "connected": 539, "lower": 540, "roman": 541, "squatting": 542, "beaded": 543, "batting": 544, "crusty": 545, "rustic": 546, "cordless": 547, "uneven": 548, "pizza": 549, "vibrant": 550, "shadowed": 551, "shaggy": 552, "industrial": 553, "polo": 554, "quilted": 555, "wrinkly": 556, "inflatable": 557, "lined": 558, "steep": 559, "oblong": 560, "unoccupied": 561, "printed": 562, "slanted": 563, "boiled": 564, "discolored": 565, "misty": 566, "cylindrical": 567, "military": 568, "massive": 569, "winding": 570, "corded": 571, "spread": 572, "wii": 573, "eaten": 574, "ruffled": 575, "burning": 576, "vinyl": 577, "groomed": 578, "formal": 579, "spiky": 580, "suspended": 581, "greasy": 582, "handmade": 583, "forested": 584, "calico": 585, "foreign": 586, "vacant": 587, "curious": 588, "upholstered": 589, "muscular": 590, "clumped": 591, "weathered": 592, "pastel": 593, "abandoned": 594, "ivory": 595, "gloomy": 596, "glossy": 597, "fluorescent": 598, "license": 599, "intricate": 600, "vast": 601, "recessed": 602, "chubby": 603, "sleepy": 604, "damaged": 605, "inflated": 606, "trash": 607, "knotted": 608, "polar": 609, "patched": 610, "rimmed": 611, "typical": 612, "powerful": 613, "breaking": 614, "capital": 615, "spinning": 616, "chalk": 617, "sealed": 618, "elongated": 619, "urban": 620, "exterior": 621}, "rel2idx": {"<NULL>": 0, "<UNK>": 1, "to the left of": 2, "to the right of": 3, "on": 4, "inside": 5, "next to": 6, "of": 7, "near": 8, "in": 9, "with": 10, "wearing": 11, "riding": 12, "sitting on top of": 13, "hanging on": 14, "sitting in": 15, "lying on": 16, "pulled by": 17, "pulling": 18, "above": 19, "riding on": 20, "going down": 21, "attached to": 22, "leaving": 23, "carrying": 24, "sitting at": 25, "in front of": 26, "behind": 27, "sitting on": 28, "at": 29, "typing on": 30, "parked on": 31, "eating": 32, "standing on": 33, "by": 34, "holding": 35, "on top of": 36, "going through": 37, "on the side of": 38, "surrounded by": 39, "flying": 40, "walking across": 41, "watching": 42, "below": 43, "walking on": 44, "hanging from": 45, "full of": 46, "beside": 47, "covered with": 48, "filled with": 49, "under": 50, "throwing": 51, "touching": 52, "holding onto": 53, "covered by": 54, "cutting": 55, "covering": 56, "crossing": 57, "growing along": 58, "using": 59, "hanging over": 60, "underneath": 61, "walking down": 62, "drinking": 63, "surrounding": 64, "working on": 65, "standing in": 66, "wrapped around": 67, "on the bottom of": 68, "around": 69, "printed on": 70, "hanging out of": 71, "standing in front of": 72, "standing under": 73, "reading": 74, "sitting around": 75, "looking in": 76, "reflected in": 77, "grazing in": 78, "walking next to": 79, "walking near": 80, "driving on": 81, "leaning against": 82, "standing by": 83, "walking with": 84, "reaching for": 85, "standing next to": 86, "enclosing": 87, "worn around": 88, "worn on": 89, "running on": 90, "on the back of": 91, "standing near": 92, "between": 93, "floating in": 94, "mounted on": 95, "lying on top of": 96, "driving down": 97, "covered in": 98, "walking in": 99, "moving": 100, "growing on": 101, "dragging": 102, "jumping on": 103, "swinging": 104, "talking to": 105, "playing in": 106, "entering": 107, "perched on": 108, "getting on": 109, "drinking from": 110, "close to": 111, "eating from": 112, "on the front of": 113, "looking at": 114, "playing with": 115, "feeding": 116, "catching": 117, "tossing": 118, "parked at": 119, "running in": 120, "sniffing": 121, "kissing": 122, "contain": 123, "flying above": 124, "flying in": 125, "leaning on": 126, "facing": 127, "followed by": 128, "following": 129, "playing": 130, "eating in": 131, "driving": 132, "parked next to": 133, "looking down at": 134, "observing": 135, "taller than": 136, "seen through": 137, "standing at": 138, "splashing": 139, "connected to": 140, "flying over": 141, "floating on": 142, "staring at": 143, "pushed by": 144, "pushing": 145, "sitting next to": 146, "parked in front of": 147, "parked behind": 148, "slicing": 149, "tying": 150, "playing on": 151, "walking through": 152, "hung on": 153, "parked along": 154, "standing behind": 155, "leaning over": 156, "growing behind": 157, "plugged into": 158, "flying through": 159, "going into": 160, "talking on": 161, "chewing": 162, "looking out": 163, "coming from": 164, "grazing on": 165, "mounted to": 166, "draped over": 167, "helping": 168, "swimming in": 169, "reflected on": 170, "parked in": 171, "sleeping on": 172, "sitting behind": 173, "beneath": 174, "hanging above": 175, "resting on": 176, "growing in": 177, "lying in": 178, "biting": 179, "standing on top of": 180, "shining through": 181, "tied to": 182, "waiting for": 183, "hitting": 184, "about to hit": 185, "skiing down": 186, "chained to": 187, "cooked in": 188, "growing next to": 189, "walking behind": 190, "walking along": 191, "on the other side of": 192, "chasing": 193, "skiing on": 194, "posing with": 195, "petting": 196, "mixed with": 197, "parked near": 198, "stacked on": 199, "growing near": 200, "hanging off": 201, "looking into": 202, "smoking": 203, "falling off": 204, "cooking": 205, "topped with": 206, "decorated with": 207, "parked beside": 208, "sitting in front of": 209, "on the edge of": 210, "boarding": 211, "walking toward": 212, "parked alongside": 213, "serving": 214, "painted on": 215, "stuck on": 216, "adjusting": 217, "washing": 218, "walking past": 219, "tied around": 220, "sitting beside": 221, "wrapped in": 222, "parked by": 223, "cleaning": 224, "drawn on": 225, "sitting inside": 226, "sitting by": 227, "sleeping in": 228, "kicking": 229, "stuck in": 230, "walking by": 231, "served on": 232, "walking towards": 233, "looking through": 234, "walking into": 235, "sitting with": 236, "sitting near": 237, "picking up": 238, "making": 239, "wading in": 240, "approaching": 241, "licking": 242, "walking to": 243, "selling": 244, "standing beside": 245, "grabbing": 246, "smiling at": 247, "hanging in": 248, "jumping off": 249, "sitting under": 250, "traveling on": 251, "climbing": 252, "pointing at": 253, "standing around": 254, "exiting": 255, "trying to catch": 256, "kept in": 257, "buying": 258, "hang from": 259, "decorated by": 260, "decorating": 261, "sitting atop": 262, "balancing on": 263, "leading": 264, "eating at": 265, "standing against": 266, "running through": 267, "growing from": 268, "longer than": 269, "preparing": 270, "scattered on": 271, "hidden by": 272, "herding": 273, "working in": 274, "riding in": 275, "skating on": 276, "walking up": 277, "coming down": 278, "photographing": 279, "growing by": 280, "reflecting in": 281, "skiing in": 282, "hugging": 283, "coming out of": 284, "sewn on": 285, "jumping over": 286, "smelling": 287, "playing at": 288, "displayed on": 289, "sprinkled on": 290, "looking over": 291, "blowing out": 292, "opening": 293, "traveling down": 294, "higher than": 295, "lying next to": 296, "lying inside": 297, "pouring": 298, "running across": 299, "in between": 300, "towing": 301, "guiding": 302, "displayed in": 303, "piled on": 304, "looking toward": 305, "shorter than": 306, "brushing": 307, "jumping in": 308, "larger than": 309, "smaller than": 310, "bigger than": 311}, "idx2label": {"0": "<NULL>", "1": "<UNK>", "2": "banana", "3": "spot", "4": "picnic", "5": "straw", "6": "meat", "7": "rice", "8": "onion", "9": "tablecloth", "10": "bowl", "11": "plantain", "12": "spoon", "13": "dish", "14": "meal", "15": "plate", "16": "tree", "17": "leaf", "18": "hat", "19": "boy", "20": "snow", "21": "ground", "22": "road", "23": "ski", "24": "foot", "25": "bush", "26": "hand", "27": "pole", "28": "twig", "29": "brush", "30": "water", "31": "branch", "32": "men", "33": "man", "34": "mud", "35": "dirt", "36": "boot", "37": "helmet", "38": "bike", "39": "tire", "40": "bag", "41": "grass", "42": "cake", "43": "faucet", "44": "window", "45": "cabinet", "46": "food", "47": "sofa", "48": "cereal box", "49": "decoration", "50": "counter", "51": "wall", "52": "blanket", "53": "wire", "54": "bicycle", "55": "cloud", "56": "sky", "57": "trailer", "58": "hotel", "59": "fence", "60": "paint", "61": "sign", "62": "rock", "63": "car", "64": "eye glass", "65": "shirt", "66": "watch", "67": "camera", "68": "toilet tank", "69": "mirror", "70": "guy", "71": "light switch", "72": "platform", "73": "building", "74": "street", "75": "people", "76": "shelter", "77": "tower", "78": "logo", "79": "wheel", "80": "truck", "81": "bench", "82": "head", "83": "hair", "84": "face", "85": "ocean", "86": "surfer", "87": "surfboard", "88": "short", "89": "hillside", "90": "person", "91": "tree trunk", "92": "leg", "93": "pant", "94": "glove", "95": "microwave", "96": "apron", "97": "kitchen", "98": "glass", "99": "fork", "100": "wine", "101": "post", "102": "number", "103": "tag", "104": "stove", "105": "ice", "106": "basket", "107": "pan", "108": "cow", "109": "barn", "110": "field", "111": "tail", "112": "roof", "113": "ear", "114": "container", "115": "knife", "116": "egg", "117": "eye", "118": "paw", "119": "dock", "120": "porch", "121": "nose", "122": "cat", "123": "neck", "124": "rope", "125": "cable", "126": "beach", "127": "wetsuit", "128": "keyboard", "129": "laptop", "130": "girl", "131": "collar", "132": "coffee cup", "133": "desk", "134": "computer", "135": "paper", "136": "ceiling", "137": "can", "138": "lid", "139": "figurine", "140": "office", "141": "cell phone", "142": "water bottle", "143": "chair", "144": "telephone pole", "145": "power line", "146": "tie", "147": "train", "148": "cone", "149": "railroad", "150": "train track", "151": "trash", "152": "graffiti", "153": "door", "154": "wing", "155": "airplane", "156": "walkway", "157": "runway", "158": "airport", "159": "word", "160": "elephant", "161": "picture", "162": "trunk", "163": "soap", "164": "floor", "165": "outlet", "166": "sink", "167": "toilet", "168": "drawer", "169": "bathroom", "170": "dispenser", "171": "countertop", "172": "device", "173": "roadway", "174": "pavement", "175": "box", "176": "intersection", "177": "house", "178": "crosswalk", "179": "arrow", "180": "puddle", "181": "salad", "182": "lunch", "183": "apple", "184": "table", "185": "lettuce", "186": "gravel", "187": "arm", "188": "mane", "189": "mouth", "190": "horn", "191": "giraffe", "192": "purse", "193": "lady", "194": "cap", "195": "boat", "196": "lemon", "197": "refrigerator", "198": "sidewalk", "199": "gate", "200": "beak", "201": "bird", "202": "tray", "203": "jacket", "204": "t-shirt", "205": "kite", "206": "street light", "207": "motorcycle", "208": "palm tree", "209": "woman", "210": "net", "211": "racket", "212": "seaweed", "213": "couple", "214": "clothes", "215": "cart", "216": "horse", "217": "seat", "218": "pipe", "219": "drink", "220": "cooler", "221": "goat", "222": "clock", "223": "pizza", "224": "tree branch", "225": "eagle", "226": "feather", "227": "train station", "228": "uniform", "229": "vegetable", "230": "bottle", "231": "flip flop", "232": "crowd", "233": "spectator", "234": "sheep", "235": "mountain", "236": "cliff", "237": "hill", "238": "frosting", "239": "sprinkle", "240": "cupcake", "241": "sauce", "242": "saucer", "243": "suitcase", "244": "plant", "245": "pepper", "246": "tomato", "247": "bean", "248": "bottle cap", "249": "liquid", "250": "carrot", "251": "pickle", "252": "wine glass", "253": "cheese", "254": "tile", "255": "potato", "256": "bone", "257": "garnish", "258": "gravy", "259": "beverage", "260": "bubble", "261": "zebra", "262": "traffic light", "263": "hot dog", "264": "roll", "265": "cup", "266": "coffee", "267": "skillet", "268": "book", "269": "spatula", "270": "mushroom", "271": "computer mouse", "272": "doll", "273": "shelf", "274": "bear", "275": "bucket", "276": "skier", "277": "tool", "278": "brick", "279": "outfit", "280": "umbrella", "281": "parking meter", "282": "display", "283": "chain", "284": "bandana", "285": "monkey", "286": "jean", "287": "necklace", "288": "frisbee", "289": "bracelet", "290": "player", "291": "ball", "292": "jersey", "293": "dress", "294": "wrist", "295": "skateboard", "296": "flag", "297": "dome", "298": "scissors", "299": "card", "300": "frame", "301": "napkin", "302": "backpack", "303": "suit", "304": "vehicle", "305": "cyclist", "306": "chimney", "307": "hedge", "308": "lawn", "309": "sun", "310": "seed", "311": "parmesan cheese", "312": "flower", "313": "toilet brush", "314": "parking lot", "315": "pocket", "316": "park", "317": "shoe", "318": "rug", "319": "menu", "320": "chopstick", "321": "broccoli", "322": "propeller", "323": "stair", "324": "stop sign", "325": "weed", "326": "letter", "327": "paint brush", "328": "mat", "329": "screen", "330": "pen", "331": "phone", "332": "coat", "333": "license plate", "334": "bun", "335": "taxi", "336": "dog", "337": "polar bear", "338": "log", "339": "step", "340": "bus", "341": "sticker", "342": "windshield", "343": "feeder", "344": "cage", "345": "fire hydrant", "346": "shore", "347": "buoy", "348": "van", "349": "cane", "350": "comb", "351": "carriage", "352": "sign post", "353": "apartment", "354": "lip", "355": "mustache", "356": "street sign", "357": "city", "358": "monster", "359": "driver", "360": "child", "361": "sweater", "362": "tongue", "363": "statue", "364": "pillar", "365": "ham", "366": "microphone", "367": "machine", "368": "cord", "369": "symbol", "370": "blind", "371": "towel", "372": "lamp", "373": "tissue", "374": "toaster", "375": "mug", "376": "pot", "377": "sand", "378": "sail", "379": "bread", "380": "strawberry", "381": "sweatshirt", "382": "train car", "383": "student", "384": "classroom", "385": "drawing", "386": "rooftop", "387": "station", "388": "bridge", "389": "smoke", "390": "ladder", "391": "locomotive", "392": "entrance", "393": "sock", "394": "stadium", "395": "bleacher", "396": "waist", "397": "life jacket", "398": "tank top", "399": "skin", "400": "artwork", "401": "sneaker", "402": "stage", "403": "alien", "404": "bell tower", "405": "cross", "406": "bell", "407": "balcony", "408": "crust", "409": "spinach", "410": "topping", "411": "chicken", "412": "magazine", "413": "baby", "414": "doorway", "415": "museum", "416": "room", "417": "label", "418": "toilet seat", "419": "catcher", "420": "pitcher", "421": "wristband", "422": "belt", "423": "dresser", "424": "nightstand", "425": "light fixture", "426": "bookcase", "427": "bed", "428": "zoo", "429": "hay", "430": "garden", "431": "deck", "432": "olive", "433": "path", "434": "name tag", "435": "planter", "436": "suv", "437": "stick", "438": "asparagus", "439": "fruit", "440": "orange", "441": "sausage", "442": "obstacle", "443": "poster", "444": "coffee table", "445": "heater", "446": "couch", "447": "pillow", "448": "remote control", "449": "tape", "450": "lock", "451": "apple logo", "452": "controller", "453": "carpet", "454": "sheet", "455": "toy", "456": "door frame", "457": "curtain", "458": "town", "459": "speaker", "460": "monitor", "461": "headphone", "462": "printer", "463": "mouse pad", "464": "garage", "465": "appliance", "466": "mailbox", "467": "bacon", "468": "silverware", "469": "shrimp", "470": "frog", "471": "utensil", "472": "butter", "473": "raspberry", "474": "butterfly", "475": "cutting board", "476": "island", "477": "fog", "478": "crane", "479": "jet", "480": "family", "481": "river", "482": "sandal", "483": "duck", "484": "ostrich", "485": "end table", "486": "ring", "487": "fur", "488": "goggles", "489": "sandwich", "490": "headband", "491": "newspaper", "492": "air", "493": "tree leaf", "494": "bookshelf", "495": "ice maker", "496": "soldier", "497": "earring", "498": "lamb", "499": "animal", "500": "farm", "501": "mask", "502": "game", "503": "home plate", "504": "baseball", "505": "beard", "506": "plain", "507": "knee pad", "508": "vest", "509": "lamp shade", "510": "living room", "511": "television", "512": "entertainment center", "513": "robe", "514": "toiletry", "515": "candle", "516": "bathtub", "517": "drain", "518": "dugout", "519": "bat", "520": "shop", "521": "bus stop", "522": "waterfall", "523": "basil", "524": "pepperoni", "525": "snowboard", "526": "heart", "527": "finger", "528": "wagon", "529": "wii controller", "530": "salt", "531": "celery", "532": "oven", "533": "tent", "534": "bull", "535": "sugar", "536": "toast", "537": "salt shaker", "538": "coach", "539": "umpire", "540": "vase", "541": "shower door", "542": "skirt", "543": "hilltop", "544": "wine bottle", "545": "spice", "546": "cabinet door", "547": "burner", "548": "gun", "549": "policeman", "550": "restaurant", "551": "staircase", "552": "briefcase", "553": "blender", "554": "soccer ball", "555": "magnet", "556": "teddy bear", "557": "picnic table", "558": "stuffed bear", "559": "grill", "560": "snow pant", "561": "robot", "562": "projector", "563": "underwear", "564": "bead", "565": "goose", "566": "ottoman", "567": "scooter", "568": "gorilla", "569": "pond", "570": "cucumber", "571": "nut", "572": "squash", "573": "coffee maker", "574": "painting", "575": "baseball bat", "576": "stone", "577": "moss", "578": "star", "579": "beer", "580": "jar", "581": "coffee mug", "582": "swimsuit", "583": "paddle", "584": "ambulance", "585": "juice", "586": "forest", "587": "flame", "588": "sunglass", "589": "canister", "590": "control panel", "591": "teeth", "592": "computer monitor", "593": "piercing", "594": "batter", "595": "picture frame", "596": "donut", "597": "owl", "598": "paper towel", "599": "herd", "600": "parent", "601": "jockey", "602": "platter", "603": "wool", "604": "tennis ball", "605": "legging", "606": "toilet bowl", "607": "trash can", "608": "trash bag", "609": "fan", "610": "team", "611": "face mask", "612": "mound", "613": "toothbrush", "614": "fish", "615": "dressing", "616": "burger", "617": "donkey", "618": "pilot", "619": "cockpit", "620": "skate park", "621": "tongs", "622": "toothpick", "623": "pastry", "624": "ski lift", "625": "manhole cover", "626": "router", "627": "calculator", "628": "charger", "629": "cabin", "630": "lake", "631": "vine", "632": "notepad", "633": "thumb", "634": "raincoat", "635": "peach", "636": "berry", "637": "wristwatch", "638": "glaze", "639": "barrier", "640": "hangar", "641": "light bulb", "642": "crate", "643": "fountain", "644": "antenna", "645": "yard", "646": "fence post", "647": "shoe lace", "648": "chocolate", "649": "powder", "650": "dough", "651": "calf", "652": "shield", "653": "chalkboard", "654": "pajama", "655": "character", "656": "comforter", "657": "headboard", "658": "canoe", "659": "french toast", "660": "pine tree", "661": "tissue box", "662": "diaper", "663": "gown", "664": "candy", "665": "foil", "666": "cooky", "667": "cherry", "668": "dessert", "669": "lime", "670": "croissant", "671": "scarf", "672": "chef", "673": "snowsuit", "674": "pasture", "675": "cream", "676": "clock tower", "677": "chandelier", "678": "scrub brush", "679": "skater", "680": "oven door", "681": "cupboard", "682": "skyscraper", "683": "desk lamp", "684": "patio", "685": "garlic", "686": "pepper shaker", "687": "sack", "688": "canopy", "689": "sailboat", "690": "harbor", "691": "spray can", "692": "binder", "693": "notebook", "694": "balloon", "695": "video game", "696": "dvd", "697": "baseball mitt", "698": "marker", "699": "egg yolk", "700": "fire extinguisher", "701": "shower", "702": "terminal", "703": "passenger", "704": "store", "705": "american flag", "706": "athletic shoe", "707": "fireplace", "708": "cowboy", "709": "pea", "710": "boulder", "711": "wii", "712": "church", "713": "kiwi", "714": "sculpture", "715": "beef", "716": "tea", "717": "dining table", "718": "stump", "719": "coin", "720": "rose", "721": "fire", "722": "flower pot", "723": "hand soap", "724": "steering wheel", "725": "cauliflower", "726": "undershirt", "727": "toy car", "728": "urinal", "729": "bouquet", "730": "pasta", "731": "medicine cabinet", "732": "soap dish", "733": "photographer", "734": "traffic sign", "735": "goal", "736": "pizza slice", "737": "hose", "738": "gas pump", "739": "pump", "740": "coke", "741": "garage door", "742": "folding chair", "743": "pencil", "744": "envelope", "745": "ipod", "746": "customer", "747": "merchandise", "748": "ketchup", "749": "coleslaw", "750": "moon", 